[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:67:68
 
 async function initCacheEntries(
   cacheDir: string
-): Promise<Array<{ key: string; size: number; expireAt: number }>> {
-  const cacheKeys = await promises.readdir(cacheDir).catch(() => [])
-  const entries: Array<{ key: string; size: number; expireAt: number }> = []
-
-  for (const cacheKey of cacheKeys) {
-    try {
-      const { expireAt, buffer } = await readFromCacheDir(cacheDir, cacheKey)
-      entries.push({
-        key: cacheKey,
-        size: buffer.byteLength,
-        expireAt,
-      })
-    } catch {
-      // Skip entries that can't be read from disk
-    }
-  }
-
-  // Sort oldest-first so we can replay them chronologically into LRU
-  return entries.sort((a, b) => a.expireAt - b.expireAt)
-}
+): Promise<Array<{ key: string; size: number; expireAt: number }>> {}
 
 export function getSharp(concurrency: number | null | undefined) {

[NoCoverage] ArrowFunction
next/src/server/image-optimizer.ts:68:60
 async function initCacheEntries(
   cacheDir: string
 ): Promise<Array<{ key: string; size: number; expireAt: number }>> {
-  const cacheKeys = await promises.readdir(cacheDir).catch(() => [])
+  const cacheKeys = await promises.readdir(cacheDir).catch(() => undefined)
   const entries: Array<{ key: string; size: number; expireAt: number }> = []
 

[NoCoverage] ArrayDeclaration
next/src/server/image-optimizer.ts:68:66
 async function initCacheEntries(
   cacheDir: string
 ): Promise<Array<{ key: string; size: number; expireAt: number }>> {
-  const cacheKeys = await promises.readdir(cacheDir).catch(() => [])
+  const cacheKeys = await promises.readdir(cacheDir).catch(() => ["Stryker was here"])
   const entries: Array<{ key: string; size: number; expireAt: number }> = []
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:71:37
   const cacheKeys = await promises.readdir(cacheDir).catch(() => [])
   const entries: Array<{ key: string; size: number; expireAt: number }> = []
 
-  for (const cacheKey of cacheKeys) {
-    try {
-      const { expireAt, buffer } = await readFromCacheDir(cacheDir, cacheKey)
-      entries.push({
-        key: cacheKey,
-        size: buffer.byteLength,
-        expireAt,
-      })
-    } catch {
-      // Skip entries that can't be read from disk
-    }
-  }
+  for (const cacheKey of cacheKeys) {}
 
   // Sort oldest-first so we can replay them chronologically into LRU

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:72:9
   const entries: Array<{ key: string; size: number; expireAt: number }> = []
 
   for (const cacheKey of cacheKeys) {
-    try {
-      const { expireAt, buffer } = await readFromCacheDir(cacheDir, cacheKey)
-      entries.push({
-        key: cacheKey,
-        size: buffer.byteLength,
-        expireAt,
-      })
-    } catch {
+    try {} catch {
       // Skip entries that can't be read from disk
     }

[NoCoverage] ArrowFunction
next/src/server/image-optimizer.ts:85:23
   }
 
   // Sort oldest-first so we can replay them chronologically into LRU
-  return entries.sort((a, b) => a.expireAt - b.expireAt)
+  return entries.sort(() => undefined)
 }
 

[NoCoverage] ArithmeticOperator
next/src/server/image-optimizer.ts:85:33
   }
 
   // Sort oldest-first so we can replay them chronologically into LRU
-  return entries.sort((a, b) => a.expireAt - b.expireAt)
+  return entries.sort((a, b) => a.expireAt + b.expireAt)
 }
 

[Killed] BlockStatement
next/src/server/image-optimizer.ts:88:66
   return entries.sort((a, b) => a.expireAt - b.expireAt)
 }
 
-export function getSharp(concurrency: number | null | undefined) {
-  if (_sharp) {
-    return _sharp
-  }
-  try {
-    _sharp = require('sharp') as typeof import('sharp')
-    if (_sharp && _sharp.concurrency() > 1) {
-      // Reducing concurrency should reduce the memory usage too.
-      // We more aggressively reduce in dev but also reduce in prod.
-      // https://sharp.pixelplumbing.com/api-utility#concurrency
-      const divisor = process.env.NODE_ENV === 'development' ? 4 : 2
-      _sharp.concurrency(
-        concurrency ?? Math.floor(Math.max(_sharp.concurrency() / divisor, 1))
-      )
-    }
-  } catch (e: unknown) {
-    if (isError(e) && e.code === 'MODULE_NOT_FOUND') {
-      throw new Error(
-        'Module `sharp` not found. Please run `npm install --cpu=wasm32 sharp` to install it.'
-      )
-    }
-    throw e
-  }
-  return _sharp
-}
+export function getSharp(concurrency: number | null | undefined) {}
 
 export interface ImageParamsResult {
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: TypeError: sharp is not a function

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:89:7
 }
 
 export function getSharp(concurrency: number | null | undefined) {
-  if (_sharp) {
+  if (true) {
     return _sharp
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: TypeError: sharp is not a function

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:89:15
 }
 
 export function getSharp(concurrency: number | null | undefined) {
-  if (_sharp) {
-    return _sharp
-  }
+  if (_sharp) {}
   try {
     _sharp = require('sharp') as typeof import('sharp')

[Killed] BlockStatement
next/src/server/image-optimizer.ts:92:7
   if (_sharp) {
     return _sharp
   }
-  try {
-    _sharp = require('sharp') as typeof import('sharp')
-    if (_sharp && _sharp.concurrency() > 1) {
-      // Reducing concurrency should reduce the memory usage too.
-      // We more aggressively reduce in dev but also reduce in prod.
-      // https://sharp.pixelplumbing.com/api-utility#concurrency
-      const divisor = process.env.NODE_ENV === 'development' ? 4 : 2
-      _sharp.concurrency(
-        concurrency ?? Math.floor(Math.max(_sharp.concurrency() / divisor, 1))
-      )
-    }
-  } catch (e: unknown) {
+  try {} catch (e: unknown) {
     if (isError(e) && e.code === 'MODULE_NOT_FOUND') {
       throw new Error(
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: TypeError: sharp is not a function

[Survived] ConditionalExpression
next/src/server/image-optimizer.ts:94:19
   }
   try {
     _sharp = require('sharp') as typeof import('sharp')
-    if (_sharp && _sharp.concurrency() > 1) {
+    if (_sharp && true) {
       // Reducing concurrency should reduce the memory usage too.
       // We more aggressively reduce in dev but also reduce in prod.

[Survived] EqualityOperator
next/src/server/image-optimizer.ts:94:19
   }
   try {
     _sharp = require('sharp') as typeof import('sharp')
-    if (_sharp && _sharp.concurrency() > 1) {
+    if (_sharp && _sharp.concurrency() >= 1) {
       // Reducing concurrency should reduce the memory usage too.
       // We more aggressively reduce in dev but also reduce in prod.

[Survived] EqualityOperator
next/src/server/image-optimizer.ts:98:23
       // Reducing concurrency should reduce the memory usage too.
       // We more aggressively reduce in dev but also reduce in prod.
       // https://sharp.pixelplumbing.com/api-utility#concurrency
-      const divisor = process.env.NODE_ENV === 'development' ? 4 : 2
+      const divisor = process.env.NODE_ENV !== 'development' ? 4 : 2
       _sharp.concurrency(
         concurrency ?? Math.floor(Math.max(_sharp.concurrency() / divisor, 1))

[Survived] ConditionalExpression
next/src/server/image-optimizer.ts:98:23
       // Reducing concurrency should reduce the memory usage too.
       // We more aggressively reduce in dev but also reduce in prod.
       // https://sharp.pixelplumbing.com/api-utility#concurrency
-      const divisor = process.env.NODE_ENV === 'development' ? 4 : 2
+      const divisor = false ? 4 : 2
       _sharp.concurrency(
         concurrency ?? Math.floor(Math.max(_sharp.concurrency() / divisor, 1))

[Survived] ArithmeticOperator
next/src/server/image-optimizer.ts:100:44
       // https://sharp.pixelplumbing.com/api-utility#concurrency
       const divisor = process.env.NODE_ENV === 'development' ? 4 : 2
       _sharp.concurrency(
-        concurrency ?? Math.floor(Math.max(_sharp.concurrency() / divisor, 1))
+        concurrency ?? Math.floor(Math.max(_sharp.concurrency() * divisor, 1))
       )
     }

[Survived] MethodExpression
next/src/server/image-optimizer.ts:100:35
       // https://sharp.pixelplumbing.com/api-utility#concurrency
       const divisor = process.env.NODE_ENV === 'development' ? 4 : 2
       _sharp.concurrency(
-        concurrency ?? Math.floor(Math.max(_sharp.concurrency() / divisor, 1))
+        concurrency ?? Math.floor(Math.min(_sharp.concurrency() / divisor, 1))
       )
     }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:103:24
         concurrency ?? Math.floor(Math.max(_sharp.concurrency() / divisor, 1))
       )
     }
-  } catch (e: unknown) {
-    if (isError(e) && e.code === 'MODULE_NOT_FOUND') {
-      throw new Error(
-        'Module `sharp` not found. Please run `npm install --cpu=wasm32 sharp` to install it.'
-      )
-    }
-    throw e
-  }
+  } catch (e: unknown) {}
   return _sharp
 }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:104:9
       )
     }
   } catch (e: unknown) {
-    if (isError(e) && e.code === 'MODULE_NOT_FOUND') {
+    if (false) {
       throw new Error(
         'Module `sharp` not found. Please run `npm install --cpu=wasm32 sharp` to install it.'

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:104:23
       )
     }
   } catch (e: unknown) {
-    if (isError(e) && e.code === 'MODULE_NOT_FOUND') {
+    if (isError(e) && true) {
       throw new Error(
         'Module `sharp` not found. Please run `npm install --cpu=wasm32 sharp` to install it.'

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:132:71
   etag: string
 }
 
-function getSupportedMimeType(options: string[], accept = ''): string {
-  const mimeType = mediaType(accept, options)
-  return accept.includes(mimeType) ? mimeType : ''
-}
+function getSupportedMimeType(options: string[], accept = ''): string {}
 
 export function getHash(items: (string | number | Buffer)[]) {

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:132:59
   etag: string
 }
 
-function getSupportedMimeType(options: string[], accept = ''): string {
+function getSupportedMimeType(options: string[], accept = "Stryker was here!"): string {
   const mimeType = mediaType(accept, options)
   return accept.includes(mimeType) ? mimeType : ''

[Killed] BlockStatement
next/src/server/image-optimizer.ts:137:62
   return accept.includes(mimeType) ? mimeType : ''
 }
 
-export function getHash(items: (string | number | Buffer)[]) {
-  const hash = createHash('sha256')
-  for (let item of items) {
-    if (typeof item === 'number') hash.update(String(item))
-    else {
-      hash.update(item)
-    }
-  }
-  // See https://en.wikipedia.org/wiki/Base64#URL_applications
-  return hash.digest('base64url')
-}
+export function getHash(items: (string | number | Buffer)[]) {}
 
 export function extractEtag(
killedBy: shouldUsePreviouslyCachedEntry should return null if upstream image does not match previous cache entry upstream etag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": undefined}

[Killed] StringLiteral
next/src/server/image-optimizer.ts:138:27
 }
 
 export function getHash(items: (string | number | Buffer)[]) {
-  const hash = createHash('sha256')
+  const hash = createHash("")
   for (let item of items) {
     if (typeof item === 'number') hash.update(String(item))
killedBy: fetchExternalImage response size limit should succeed when exactly matching maximumResponseBody config on first chunk
statusReason: Error: Digest method not supported

[Killed] BlockStatement
next/src/server/image-optimizer.ts:139:27
 
 export function getHash(items: (string | number | Buffer)[]) {
   const hash = createHash('sha256')
-  for (let item of items) {
-    if (typeof item === 'number') hash.update(String(item))
-    else {
-      hash.update(item)
-    }
-  }
+  for (let item of items) {}
   // See https://en.wikipedia.org/wiki/Base64#URL_applications
   return hash.digest('base64url')
killedBy: shouldUsePreviouslyCachedEntry should return null if upstream image does not match previous cache entry upstream etag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "47DEQpj8HBSa-_TImW-5JCeuQeRkm5NMpJWZG3hSuFU"}

[Survived] ConditionalExpression
next/src/server/image-optimizer.ts:140:9
 export function getHash(items: (string | number | Buffer)[]) {
   const hash = createHash('sha256')
   for (let item of items) {
-    if (typeof item === 'number') hash.update(String(item))
+    if (false) hash.update(String(item))
     else {
       hash.update(item)

[Survived] EqualityOperator
next/src/server/image-optimizer.ts:140:9
 export function getHash(items: (string | number | Buffer)[]) {
   const hash = createHash('sha256')
   for (let item of items) {
-    if (typeof item === 'number') hash.update(String(item))
+    if (typeof item !== 'number') hash.update(String(item))
     else {
       hash.update(item)

[Killed] BlockStatement
next/src/server/image-optimizer.ts:141:10
   const hash = createHash('sha256')
   for (let item of items) {
     if (typeof item === 'number') hash.update(String(item))
-    else {
-      hash.update(item)
-    }
+    else {}
   }
   // See https://en.wikipedia.org/wiki/Base64#URL_applications
killedBy: shouldUsePreviouslyCachedEntry should return null if upstream image does not match previous cache entry upstream etag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "47DEQpj8HBSa-_TImW-5JCeuQeRkm5NMpJWZG3hSuFU"}

[Killed] BlockStatement
next/src/server/image-optimizer.ts:152:3
 export function extractEtag(
   etag: string | null | undefined,
   imageBuffer: Buffer
-) {
-  if (etag) {
-    // upstream etag needs to be base64url encoded due to weak etag signature
-    // as we store this in the cache-entry file name.
-    return Buffer.from(etag).toString('base64url')
-  }
-  return getImageEtag(imageBuffer)
-}
+) {}
 
 export function getImageEtag(image: Buffer) {
killedBy: extractEtag should return base64url encoded etag if etag is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "c2FtcGxlLWV0YWc"
Received: undefined

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:153:7
   etag: string | null | undefined,
   imageBuffer: Buffer
 ) {
-  if (etag) {
+  if (false) {
     // upstream etag needs to be base64url encoded due to weak etag signature
     // as we store this in the cache-entry file name.
killedBy: extractEtag should return base64url encoded etag if etag is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "c2FtcGxlLWV0YWc"
Received: "47DEQpj8HBSa-_TImW-5JCeuQeRkm5NMpJWZG3hSuFU"

[Killed] BlockStatement
next/src/server/image-optimizer.ts:153:13
   etag: string | null | undefined,
   imageBuffer: Buffer
 ) {
-  if (etag) {
-    // upstream etag needs to be base64url encoded due to weak etag signature
-    // as we store this in the cache-entry file name.
-    return Buffer.from(etag).toString('base64url')
-  }
+  if (etag) {}
   return getImageEtag(imageBuffer)
 }
killedBy: extractEtag should return base64url encoded etag if etag is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "c2FtcGxlLWV0YWc"
Received: "47DEQpj8HBSa-_TImW-5JCeuQeRkm5NMpJWZG3hSuFU"

[Killed] BlockStatement
next/src/server/image-optimizer.ts:161:45
   return getImageEtag(imageBuffer)
 }
 
-export function getImageEtag(image: Buffer) {
-  return getHash([image])
-}
+export function getImageEtag(image: Buffer) {}
 
 async function writeToCacheDir(
killedBy: shouldUsePreviouslyCachedEntry should return null if upstream image does not match previous cache entry upstream etag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": undefined}

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:174:3
   buffer: Buffer,
   etag: string,
   upstreamEtag: string
-) {
-  const dir = join(/* turbopackIgnore: true */ cacheDir, cacheKey)
-  const filename = join(
-    /* turbopackIgnore: true */
-    dir,
-    `${maxAge}.${expireAt}.${etag}.${upstreamEtag}.${extension}`
-  )
-
-  await promises.rm(dir, { recursive: true, force: true }).catch(() => {})
-
-  await promises.mkdir(dir, { recursive: true })
-  await promises.writeFile(filename, buffer)
-}
+) {}
 
 async function readFromCacheDir(cacheDir: string, cacheKey: string) {

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:182:39
     `${maxAge}.${expireAt}.${etag}.${upstreamEtag}.${extension}`
   )
 
-  await promises.rm(dir, { recursive: true, force: true }).catch(() => {})
+  await promises.rm(dir, { recursive: false, force: true }).catch(() => {})
 
   await promises.mkdir(dir, { recursive: true })

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:182:52
     `${maxAge}.${expireAt}.${etag}.${upstreamEtag}.${extension}`
   )
 
-  await promises.rm(dir, { recursive: true, force: true }).catch(() => {})
+  await promises.rm(dir, { recursive: true, force: false }).catch(() => {})
 
   await promises.mkdir(dir, { recursive: true })

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:184:42
 
   await promises.rm(dir, { recursive: true, force: true }).catch(() => {})
 
-  await promises.mkdir(dir, { recursive: true })
+  await promises.mkdir(dir, { recursive: false })
   await promises.writeFile(filename, buffer)
 }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:188:69
   await promises.writeFile(filename, buffer)
 }
 
-async function readFromCacheDir(cacheDir: string, cacheKey: string) {
-  const dir = join(/* turbopackIgnore: true */ cacheDir, cacheKey)
-  const files = await promises.readdir(dir)
-  const file = files[0]
-  if (!file) {
-    throw new Error(
-      `Invariant: cache entry "${cacheKey}" not found in dir "${cacheDir}"`
-    )
-  }
-  const [maxAgeSt, expireAtSt, etag, upstreamEtag, extension] = file.split(
-    '.',
-    5
-  )
-  const filePath = join(/* turbopackIgnore: true */ dir, file)
-  const buffer = await promises.readFile(/* turbopackIgnore: true */ filePath)
-  const expireAt = Number(expireAtSt)
-  const maxAge = Number(maxAgeSt)
-  return { maxAge, expireAt, etag, upstreamEtag, buffer, extension }
-}
+async function readFromCacheDir(cacheDir: string, cacheKey: string) {}
 
 async function deleteFromCacheDir(cacheDir: string, cacheKey: string) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:192:7
   const dir = join(/* turbopackIgnore: true */ cacheDir, cacheKey)
   const files = await promises.readdir(dir)
   const file = files[0]
-  if (!file) {
+  if (true) {
     throw new Error(
       `Invariant: cache entry "${cacheKey}" not found in dir "${cacheDir}"`

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:192:7
   const dir = join(/* turbopackIgnore: true */ cacheDir, cacheKey)
   const files = await promises.readdir(dir)
   const file = files[0]
-  if (!file) {
+  if (file) {
     throw new Error(
       `Invariant: cache entry "${cacheKey}" not found in dir "${cacheDir}"`

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:194:7
   const file = files[0]
   if (!file) {
     throw new Error(
-      `Invariant: cache entry "${cacheKey}" not found in dir "${cacheDir}"`
+      ``
     )
   }

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:205:10
   const buffer = await promises.readFile(/* turbopackIgnore: true */ filePath)
   const expireAt = Number(expireAtSt)
   const maxAge = Number(maxAgeSt)
-  return { maxAge, expireAt, etag, upstreamEtag, buffer, extension }
+  return {}
 }
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:208:71
   return { maxAge, expireAt, etag, upstreamEtag, buffer, extension }
 }
 
-async function deleteFromCacheDir(cacheDir: string, cacheKey: string) {
-  return promises
-    .rm(join(/* turbopackIgnore: true */ cacheDir, cacheKey), {
-      recursive: true,
-      force: true,
-    })
-    .catch((err) => {
-      Log.error(`Failed to delete cache key ${cacheKey}`, err)
-    })
-}
+async function deleteFromCacheDir(cacheDir: string, cacheKey: string) {}
 
 /**

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:211:18
 async function deleteFromCacheDir(cacheDir: string, cacheKey: string) {
   return promises
     .rm(join(/* turbopackIgnore: true */ cacheDir, cacheKey), {
-      recursive: true,
+      recursive: false,
       force: true,
     })

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:212:14
   return promises
     .rm(join(/* turbopackIgnore: true */ cacheDir, cacheKey), {
       recursive: true,
-      force: true,
+      force: false,
     })
     .catch((err) => {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:214:21
       recursive: true,
       force: true,
     })
-    .catch((err) => {
-      Log.error(`Failed to delete cache key ${cacheKey}`, err)
-    })
+    .catch((err) => {})
 }
 

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:215:17
       force: true,
     })
     .catch((err) => {
-      Log.error(`Failed to delete cache key ${cacheKey}`, err)
+      Log.error(``, err)
     })
 }

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:229:7
   skipMetadata: boolean | null | undefined,
   concurrency?: number | null | undefined
 ): Promise<string | null> {
-  if (buffer.byteLength === 0) {
+  if (false) {
     return null
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for empty buffer
statusReason: Error: Input Buffer is empty

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:229:7
   skipMetadata: boolean | null | undefined,
   concurrency?: number | null | undefined
 ): Promise<string | null> {
-  if (buffer.byteLength === 0) {
+  if (true) {
     return null
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/jpeg"
Received: null

[Killed] MethodExpression
next/src/server/image-optimizer.ts:232:7
   if (buffer.byteLength === 0) {
     return null
   }
-  if ([0xff, 0xd8, 0xff].every((b, i) => buffer[i] === b)) {
+  if ([0xff, 0xd8, 0xff].some((b, i) => buffer[i] === b)) {
     return JPEG
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return jxl
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/jxl"
Received: "image/jpeg"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:232:42
   if (buffer.byteLength === 0) {
     return null
   }
-  if ([0xff, 0xd8, 0xff].every((b, i) => buffer[i] === b)) {
+  if ([0xff, 0xd8, 0xff].every((b, i) => buffer[i] !== b)) {
     return JPEG
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jpeg"

[Killed] MethodExpression
next/src/server/image-optimizer.ts:236:5
     return JPEG
   }
   if (
-    [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a].every(
-      (b, i) => buffer[i] === b
-    )
+    [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a].some((b, i) => buffer[i] === b)
   ) {
     return PNG
killedBy: detectContentType with imgOptSkipMetadata: false should return pdf
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "application/pdf"
Received: "image/png"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:236:5
     return JPEG
   }
   if (
-    [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a].every(
-      (b, i) => buffer[i] === b
-    )
+    true
   ) {
     return PNG
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/png"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:237:17
   }
   if (
     [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a].every(
-      (b, i) => buffer[i] === b
+      (b, i) => buffer[i] !== b
     )
   ) {
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/png"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:237:17
   }
   if (
     [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a].every(
-      (b, i) => buffer[i] === b
+      (b, i) => true
     )
   ) {
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/png"

[Survived] BlockStatement
next/src/server/image-optimizer.ts:239:5
     [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a].every(
       (b, i) => buffer[i] === b
     )
-  ) {
-    return PNG
-  }
+  ) {}
   if ([0x47, 0x49, 0x46, 0x38].every((b, i) => buffer[i] === b)) {
     return GIF

[Killed] MethodExpression
next/src/server/image-optimizer.ts:242:7
   ) {
     return PNG
   }
-  if ([0x47, 0x49, 0x46, 0x38].every((b, i) => buffer[i] === b)) {
+  if ([0x47, 0x49, 0x46, 0x38].some((b, i) => buffer[i] === b)) {
     return GIF
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return webp
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/webp"
Received: "image/gif"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:242:48
   ) {
     return PNG
   }
-  if ([0x47, 0x49, 0x46, 0x38].every((b, i) => buffer[i] === b)) {
+  if ([0x47, 0x49, 0x46, 0x38].every((b, i) => buffer[i] !== b)) {
     return GIF
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/gif"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:246:5
     return GIF
   }
   if (
-    [0x52, 0x49, 0x46, 0x46, 0, 0, 0, 0, 0x57, 0x45, 0x42, 0x50].every(
-      (b, i) => !b || buffer[i] === b
-    )
+    true
   ) {
     return WEBP
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/webp"

[Killed] MethodExpression
next/src/server/image-optimizer.ts:246:5
     return GIF
   }
   if (
-    [0x52, 0x49, 0x46, 0x46, 0, 0, 0, 0, 0x57, 0x45, 0x42, 0x50].every(
-      (b, i) => !b || buffer[i] === b
-    )
+    [0x52, 0x49, 0x46, 0x46, 0, 0, 0, 0, 0x57, 0x45, 0x42, 0x50].some((b, i) => !b || buffer[i] === b)
   ) {
     return WEBP
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/webp"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:247:23
   }
   if (
     [0x52, 0x49, 0x46, 0x46, 0, 0, 0, 0, 0x57, 0x45, 0x42, 0x50].every(
-      (b, i) => !b || buffer[i] === b
+      (b, i) => !b || buffer[i] !== b
     )
   ) {
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/webp"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:247:17
   }
   if (
     [0x52, 0x49, 0x46, 0x46, 0, 0, 0, 0, 0x57, 0x45, 0x42, 0x50].every(
-      (b, i) => !b || buffer[i] === b
+      (b, i) => true
     )
   ) {
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/webp"

[Survived] BlockStatement
next/src/server/image-optimizer.ts:249:5
     [0x52, 0x49, 0x46, 0x46, 0, 0, 0, 0, 0x57, 0x45, 0x42, 0x50].every(
       (b, i) => !b || buffer[i] === b
     )
-  ) {
-    return WEBP
-  }
+  ) {}
   if ([0x3c, 0x3f, 0x78, 0x6d, 0x6c].every((b, i) => buffer[i] === b)) {
     return SVG

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:252:54
   ) {
     return WEBP
   }
-  if ([0x3c, 0x3f, 0x78, 0x6d, 0x6c].every((b, i) => buffer[i] === b)) {
+  if ([0x3c, 0x3f, 0x78, 0x6d, 0x6c].every((b, i) => true)) {
     return SVG
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/svg+xml"
