[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:24:9
   const dynamicPaths = new Set<string>()
 
   for (let path of paths) {
-    if (isDynamicRoute(path)) {
+    if (false) {
       if (isInterceptionRouteAppPath(path)) {
         path = extractInterceptionRouteInformation(path).interceptedRoute
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:24:9
   const dynamicPaths = new Set<string>()
 
   for (let path of paths) {
-    if (isDynamicRoute(path)) {
+    if (true) {
       if (isInterceptionRouteAppPath(path)) {
         path = extractInterceptionRouteInformation(path).interceptedRoute
killedBy: createClientRouterFilter — mutation adequacy tests adds plain static paths to the static filter only (by count)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:25:11
 
   for (let path of paths) {
     if (isDynamicRoute(path)) {
-      if (isInterceptionRouteAppPath(path)) {
+      if (true) {
         path = extractInterceptionRouteInformation(path).interceptedRoute
       }
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: Invalid interception route: /blog/[slug]. Must be in the format /<intercepting route>/(..|...|..)(..)/<intercepted route>

[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:25:11
 
   for (let path of paths) {
     if (isDynamicRoute(path)) {
-      if (isInterceptionRouteAppPath(path)) {
+      if (false) {
         path = extractInterceptionRouteInformation(path).interceptedRoute
       }
killedBy: createClientRouterFilter — mutation adequacy tests extracts the intercepted route for interception app paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
next/src/lib/create-client-router-filter.ts:30:36
       }
 
       let subPath = ''
-      const pathParts = path.split('/')
+      const pathParts = path.split("")
 
       // start at 1 since we split on '/' and the path starts
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
next/src/lib/create-client-router-filter.ts:34:50
 
       // start at 1 since we split on '/' and the path starts
       // with this so the first entry is an empty string
-      for (let i = 1; i < pathParts.length; i++) {
-        const curPart = pathParts[i]
-
-        if (curPart.startsWith('[')) {
-          break
-        }
-        subPath = `${subPath}/${curPart}`
-      }
+      for (let i = 1; i < pathParts.length; i++) {}
 
       if (subPath) {
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
next/src/lib/create-client-router-filter.ts:34:23
 
       // start at 1 since we split on '/' and the path starts
       // with this so the first entry is an empty string
-      for (let i = 1; i < pathParts.length; i++) {
+      for (let i = 1; i >= pathParts.length; i++) {
         const curPart = pathParts[i]
 
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
next/src/lib/create-client-router-filter.ts:37:38
       for (let i = 1; i < pathParts.length; i++) {
         const curPart = pathParts[i]
 
-        if (curPart.startsWith('[')) {
-          break
-        }
+        if (curPart.startsWith('[')) {}
         subPath = `${subPath}/${curPart}`
       }
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:37:13
       for (let i = 1; i < pathParts.length; i++) {
         const curPart = pathParts[i]
 
-        if (curPart.startsWith('[')) {
+        if (false) {
           break
         }
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
next/src/lib/create-client-router-filter.ts:40:19
         if (curPart.startsWith('[')) {
           break
         }
-        subPath = `${subPath}/${curPart}`
+        subPath = ``
       }
 
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:43:11
         subPath = `${subPath}/${curPart}`
       }
 
-      if (subPath) {
+      if (false) {
         dynamicPaths.add(subPath)
       }
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
next/src/lib/create-client-router-filter.ts:43:20
         subPath = `${subPath}/${curPart}`
       }
 
-      if (subPath) {
-        dynamicPaths.add(subPath)
-      }
+      if (subPath) {}
     } else {
       staticPaths.add(path)
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
next/src/lib/create-client-router-filter.ts:46:12
       if (subPath) {
         dynamicPaths.add(subPath)
       }
-    } else {
-      staticPaths.add(path)
-    }
+    } else {}
   }
 
killedBy: createClientRouterFilter — mutation adequacy tests adds plain static paths to the static filter only (by count)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
next/src/lib/create-client-router-filter.ts:51:37
     }
   }
 
-  for (const redirect of redirects) {
-    const { source } = redirect
-    const path = removeTrailingSlash(source)
-    let tokens: Token[] = []
-
-    try {
-      tokens = tryToParsePath(source).tokens || []
-    } catch {}
-
-    if (tokens.every((token) => typeof token === 'string')) {
-      // only include static redirects initially
-      staticPaths.add(path)
-    }
-  }
+  for (const redirect of redirects) {}
 
   const staticFilter = BloomFilter.from([...staticPaths], allowedErrorRate)
killedBy: createClientRouterFilter — mutation adequacy tests includes a static redirect source in staticFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ArrayDeclaration
next/src/lib/create-client-router-filter.ts:54:27
   for (const redirect of redirects) {
     const { source } = redirect
     const path = removeTrailingSlash(source)
-    let tokens: Token[] = []
+    let tokens: Token[] = ["Stryker was here"]
 
     try {

[Killed] BlockStatement
next/src/lib/create-client-router-filter.ts:56:9
     const path = removeTrailingSlash(source)
     let tokens: Token[] = []
 
-    try {
-      tokens = tryToParsePath(source).tokens || []
-    } catch {}
+    try {} catch {}
 
     if (tokens.every((token) => typeof token === 'string')) {
killedBy: createClientRouterFilter — mutation adequacy tests does NOT include dynamic/parameterized redirect sources in staticFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:57:16
     let tokens: Token[] = []
 
     try {
-      tokens = tryToParsePath(source).tokens || []
+      tokens = true
     } catch {}
 
killedBy: createClientRouterFilter — mutation adequacy tests includes a static redirect source in staticFilter
statusReason: TypeError: tokens.every is not a function

[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:57:16
     let tokens: Token[] = []
 
     try {
-      tokens = tryToParsePath(source).tokens || []
+      tokens = false
     } catch {}
 
killedBy: createClientRouterFilter — mutation adequacy tests includes a static redirect source in staticFilter
statusReason: TypeError: tokens.every is not a function

[Killed] ArrowFunction
next/src/lib/create-client-router-filter.ts:60:22
       tokens = tryToParsePath(source).tokens || []
     } catch {}
 
-    if (tokens.every((token) => typeof token === 'string')) {
+    if (tokens.every(() => undefined)) {
       // only include static redirects initially
       staticPaths.add(path)
killedBy: createClientRouterFilter — mutation adequacy tests includes a static redirect source in staticFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
next/src/lib/create-client-router-filter.ts:60:9
       tokens = tryToParsePath(source).tokens || []
     } catch {}
 
-    if (tokens.every((token) => typeof token === 'string')) {
+    if (true) {
       // only include static redirects initially
       staticPaths.add(path)
killedBy: createClientRouterFilter — mutation adequacy tests does NOT include dynamic/parameterized redirect sources in staticFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArrayDeclaration
next/src/lib/create-client-router-filter.ts:68:42
 
   const staticFilter = BloomFilter.from([...staticPaths], allowedErrorRate)
 
-  const dynamicFilter = BloomFilter.from([...dynamicPaths], allowedErrorRate)
+  const dynamicFilter = BloomFilter.from([], allowedErrorRate)
   const data = {
     staticFilter: staticFilter.export(),
killedBy: createClientRouterFilter — mutation adequacy tests adds extracted prefix of a dynamic route to dynamicFilter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ObjectLiteral
next/src/lib/create-client-router-filter.ts:69:16
   const staticFilter = BloomFilter.from([...staticPaths], allowedErrorRate)
 
   const dynamicFilter = BloomFilter.from([...dynamicPaths], allowedErrorRate)
-  const data = {
-    staticFilter: staticFilter.export(),
-    dynamicFilter: dynamicFilter.export(),
-  }
+  const data = {}
   return data
 }
killedBy: createClientRouterFilter — mutation adequacy tests adds plain static paths to the static filter only (by count)
statusReason: TypeError: Cannot read properties of undefined (reading 'numItems')
