[Killed] EqualityOperator
next/src/server/image-optimizer.ts:252:54
   ) {
     return WEBP
   }
-  if ([0x3c, 0x3f, 0x78, 0x6d, 0x6c].every((b, i) => buffer[i] === b)) {
+  if ([0x3c, 0x3f, 0x78, 0x6d, 0x6c].every((b, i) => buffer[i] !== b)) {
     return SVG
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/svg+xml"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:255:7
   if ([0x3c, 0x3f, 0x78, 0x6d, 0x6c].every((b, i) => buffer[i] === b)) {
     return SVG
   }
-  if ([0x3c, 0x73, 0x76, 0x67].every((b, i) => buffer[i] === b)) {
+  if (true) {
     return SVG
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/svg+xml"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:255:48
   if ([0x3c, 0x3f, 0x78, 0x6d, 0x6c].every((b, i) => buffer[i] === b)) {
     return SVG
   }
-  if ([0x3c, 0x73, 0x76, 0x67].every((b, i) => buffer[i] === b)) {
+  if ([0x3c, 0x73, 0x76, 0x67].every((b, i) => true)) {
     return SVG
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/svg+xml"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:259:5
     return SVG
   }
   if (
-    [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x61, 0x76, 0x69, 0x66].every(
-      (b, i) => !b || buffer[i] === b
-    )
+    true
   ) {
     return AVIF
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/avif"

[Killed] MethodExpression
next/src/server/image-optimizer.ts:259:5
     return SVG
   }
   if (
-    [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x61, 0x76, 0x69, 0x66].every(
-      (b, i) => !b || buffer[i] === b
-    )
+    [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x61, 0x76, 0x69, 0x66].some((b, i) => !b || buffer[i] === b)
   ) {
     return AVIF
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/avif"

[Killed] LogicalOperator
next/src/server/image-optimizer.ts:260:17
   }
   if (
     [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x61, 0x76, 0x69, 0x66].every(
-      (b, i) => !b || buffer[i] === b
+      (b, i) => !b && buffer[i] === b
     )
   ) {
killedBy: detectContentType with imgOptSkipMetadata: false should return avif
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/avif"
Received: null

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:260:23
   }
   if (
     [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x61, 0x76, 0x69, 0x66].every(
-      (b, i) => !b || buffer[i] === b
+      (b, i) => !b || false
     )
   ) {
killedBy: detectContentType with imgOptSkipMetadata: false should return avif
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/avif"
Received: null

[Killed] BlockStatement
next/src/server/image-optimizer.ts:262:5
     [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x61, 0x76, 0x69, 0x66].every(
       (b, i) => !b || buffer[i] === b
     )
-  ) {
-    return AVIF
-  }
+  ) {}
   if ([0x00, 0x00, 0x01, 0x00].every((b, i) => buffer[i] === b)) {
     return ICO
killedBy: detectContentType with imgOptSkipMetadata: false should return avif
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/avif"
Received: null

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:265:48
   ) {
     return AVIF
   }
-  if ([0x00, 0x00, 0x01, 0x00].every((b, i) => buffer[i] === b)) {
+  if ([0x00, 0x00, 0x01, 0x00].every((b, i) => buffer[i] !== b)) {
     return ICO
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/x-icon"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:265:48
   ) {
     return AVIF
   }
-  if ([0x00, 0x00, 0x01, 0x00].every((b, i) => buffer[i] === b)) {
+  if ([0x00, 0x00, 0x01, 0x00].every((b, i) => true)) {
     return ICO
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/x-icon"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:268:48
   if ([0x00, 0x00, 0x01, 0x00].every((b, i) => buffer[i] === b)) {
     return ICO
   }
-  if ([0x69, 0x63, 0x6e, 0x73].every((b, i) => buffer[i] === b)) {
+  if ([0x69, 0x63, 0x6e, 0x73].every((b, i) => buffer[i] !== b)) {
     return ICNS
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/x-icns"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:268:7
   if ([0x00, 0x00, 0x01, 0x00].every((b, i) => buffer[i] === b)) {
     return ICO
   }
-  if ([0x69, 0x63, 0x6e, 0x73].every((b, i) => buffer[i] === b)) {
+  if (true) {
     return ICNS
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/x-icns"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:271:48
   if ([0x69, 0x63, 0x6e, 0x73].every((b, i) => buffer[i] === b)) {
     return ICNS
   }
-  if ([0x49, 0x49, 0x2a, 0x00].every((b, i) => buffer[i] === b)) {
+  if ([0x49, 0x49, 0x2a, 0x00].every((b, i) => true)) {
     return TIFF
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/tiff"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:271:48
   if ([0x69, 0x63, 0x6e, 0x73].every((b, i) => buffer[i] === b)) {
     return ICNS
   }
-  if ([0x49, 0x49, 0x2a, 0x00].every((b, i) => buffer[i] === b)) {
+  if ([0x49, 0x49, 0x2a, 0x00].every((b, i) => buffer[i] !== b)) {
     return TIFF
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/tiff"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:274:36
   if ([0x49, 0x49, 0x2a, 0x00].every((b, i) => buffer[i] === b)) {
     return TIFF
   }
-  if ([0x42, 0x4d].every((b, i) => buffer[i] === b)) {
+  if ([0x42, 0x4d].every((b, i) => buffer[i] !== b)) {
     return BMP
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/bmp"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:274:7
   if ([0x49, 0x49, 0x2a, 0x00].every((b, i) => buffer[i] === b)) {
     return TIFF
   }
-  if ([0x42, 0x4d].every((b, i) => buffer[i] === b)) {
+  if (true) {
     return BMP
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/bmp"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:277:36
   if ([0x42, 0x4d].every((b, i) => buffer[i] === b)) {
     return BMP
   }
-  if ([0xff, 0x0a].every((b, i) => buffer[i] === b)) {
+  if ([0xff, 0x0a].every((b, i) => true)) {
     return JXL
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jxl"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:277:36
   if ([0x42, 0x4d].every((b, i) => buffer[i] === b)) {
     return BMP
   }
-  if ([0xff, 0x0a].every((b, i) => buffer[i] === b)) {
+  if ([0xff, 0x0a].every((b, i) => buffer[i] !== b)) {
     return JXL
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jxl"

[Killed] MethodExpression
next/src/server/image-optimizer.ts:281:5
     return JXL
   }
   if (
-    [
-      0x00, 0x00, 0x00, 0x0c, 0x4a, 0x58, 0x4c, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
-    ].every((b, i) => buffer[i] === b)
+    [0x00, 0x00, 0x00, 0x0c, 0x4a, 0x58, 0x4c, 0x20, 0x0d, 0x0a, 0x87, 0x0a].some((b, i) => buffer[i] === b)
   ) {
     return JXL
killedBy: detectContentType with imgOptSkipMetadata: false should return jp2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/jp2"
Received: "image/jxl"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:281:5
     return JXL
   }
   if (
-    [
-      0x00, 0x00, 0x00, 0x0c, 0x4a, 0x58, 0x4c, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
-    ].every((b, i) => buffer[i] === b)
+    true
   ) {
     return JXL
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jxl"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:283:23
   if (
     [
       0x00, 0x00, 0x00, 0x0c, 0x4a, 0x58, 0x4c, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
-    ].every((b, i) => buffer[i] === b)
+    ].every((b, i) => buffer[i] !== b)
   ) {
     return JXL
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jxl"

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:283:23
   if (
     [
       0x00, 0x00, 0x00, 0x0c, 0x4a, 0x58, 0x4c, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
-    ].every((b, i) => buffer[i] === b)
+    ].every((b, i) => true)
   ) {
     return JXL
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jxl"

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:284:5
     [
       0x00, 0x00, 0x00, 0x0c, 0x4a, 0x58, 0x4c, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
     ].every((b, i) => buffer[i] === b)
-  ) {
-    return JXL
-  }
+  ) {}
   if (
     [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x68, 0x65, 0x69, 0x63].every(

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:288:5
     return JXL
   }
   if (
-    [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x68, 0x65, 0x69, 0x63].every(
-      (b, i) => !b || buffer[i] === b
-    )
+    false
   ) {
     return HEIC
killedBy: detectContentType with imgOptSkipMetadata: false should return heic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/heic"
Received: null

[Killed] MethodExpression
next/src/server/image-optimizer.ts:288:5
     return JXL
   }
   if (
-    [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x68, 0x65, 0x69, 0x63].every(
-      (b, i) => !b || buffer[i] === b
-    )
+    [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x68, 0x65, 0x69, 0x63].some((b, i) => !b || buffer[i] === b)
   ) {
     return HEIC
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/heic"

[Killed] ArrowFunction
next/src/server/image-optimizer.ts:289:7
   }
   if (
     [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x68, 0x65, 0x69, 0x63].every(
-      (b, i) => !b || buffer[i] === b
+      () => undefined
     )
   ) {
killedBy: detectContentType with imgOptSkipMetadata: false should return heic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/heic"
Received: null

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:289:23
   }
   if (
     [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x68, 0x65, 0x69, 0x63].every(
-      (b, i) => !b || buffer[i] === b
+      (b, i) => !b || false
     )
   ) {
killedBy: detectContentType with imgOptSkipMetadata: false should return heic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/heic"
Received: null

[Killed] BlockStatement
next/src/server/image-optimizer.ts:291:5
     [0, 0, 0, 0, 0x66, 0x74, 0x79, 0x70, 0x68, 0x65, 0x69, 0x63].every(
       (b, i) => !b || buffer[i] === b
     )
-  ) {
-    return HEIC
-  }
+  ) {}
   if ([0x25, 0x50, 0x44, 0x46, 0x2d].every((b, i) => buffer[i] === b)) {
     return PDF
killedBy: detectContentType with imgOptSkipMetadata: false should return heic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/heic"
Received: null

[Killed] ArrowFunction
next/src/server/image-optimizer.ts:294:44
   ) {
     return HEIC
   }
-  if ([0x25, 0x50, 0x44, 0x46, 0x2d].every((b, i) => buffer[i] === b)) {
+  if ([0x25, 0x50, 0x44, 0x46, 0x2d].every(() => undefined)) {
     return PDF
   }
killedBy: detectContentType with imgOptSkipMetadata: false should return pdf
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "application/pdf"
Received: null

[Killed] BlockStatement
next/src/server/image-optimizer.ts:294:72
   ) {
     return HEIC
   }
-  if ([0x25, 0x50, 0x44, 0x46, 0x2d].every((b, i) => buffer[i] === b)) {
-    return PDF
-  }
+  if ([0x25, 0x50, 0x44, 0x46, 0x2d].every((b, i) => buffer[i] === b)) {}
   if (
     [
killedBy: detectContentType with imgOptSkipMetadata: false should return pdf
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "application/pdf"
Received: null

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:298:5
     return PDF
   }
   if (
-    [
-      0x00, 0x00, 0x00, 0x0c, 0x6a, 0x50, 0x20, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
-    ].every((b, i) => buffer[i] === b)
+    true
   ) {
     return JP2
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jp2"

[Survived] MethodExpression
next/src/server/image-optimizer.ts:298:5
     return PDF
   }
   if (
-    [
-      0x00, 0x00, 0x00, 0x0c, 0x6a, 0x50, 0x20, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
-    ].every((b, i) => buffer[i] === b)
+    [0x00, 0x00, 0x00, 0x0c, 0x6a, 0x50, 0x20, 0x20, 0x0d, 0x0a, 0x87, 0x0a].some((b, i) => buffer[i] === b)
   ) {
     return JP2

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:300:23
   if (
     [
       0x00, 0x00, 0x00, 0x0c, 0x6a, 0x50, 0x20, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
-    ].every((b, i) => buffer[i] === b)
+    ].every((b, i) => true)
   ) {
     return JP2
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jp2"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:300:23
   if (
     [
       0x00, 0x00, 0x00, 0x0c, 0x6a, 0x50, 0x20, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
-    ].every((b, i) => buffer[i] === b)
+    ].every((b, i) => buffer[i] !== b)
   ) {
     return JP2
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "image/jp2"

[Survived] BlockStatement
next/src/server/image-optimizer.ts:301:5
     [
       0x00, 0x00, 0x00, 0x0c, 0x6a, 0x50, 0x20, 0x20, 0x0d, 0x0a, 0x87, 0x0a,
     ].every((b, i) => buffer[i] === b)
-  ) {
-    return JP2
-  }
+  ) {}
 
   let format:

[Survived] ConditionalExpression
next/src/server/image-optimizer.ts:311:7
     | undefined
   format = detector(buffer)
 
-  if (!format && !skipMetadata) {
+  if (false) {
     const sharp = getSharp(concurrency)
     const meta = await sharp(buffer)

[Survived] BooleanLiteral
next/src/server/image-optimizer.ts:311:7
     | undefined
   format = detector(buffer)
 
-  if (!format && !skipMetadata) {
+  if (format && !skipMetadata) {
     const sharp = getSharp(concurrency)
     const meta = await sharp(buffer)

[Survived] ArrowFunction
next/src/server/image-optimizer.ts:315:14
     const sharp = getSharp(concurrency)
     const meta = await sharp(buffer)
       .metadata()
-      .catch((_) => null)
+      .catch(() => undefined)
     format = meta?.format
   }

[Killed] OptionalChaining
next/src/server/image-optimizer.ts:316:14
     const meta = await sharp(buffer)
       .metadata()
       .catch((_) => null)
-    format = meta?.format
+    format = meta.format
   }
 
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: TypeError: Cannot read properties of null (reading 'format')

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:320:5
   }
 
   switch (format) {
-    case 'avif':
-      return AVIF
+    case 'avif':
     case 'webp':
       return WEBP

[Survived] StringLiteral
next/src/server/image-optimizer.ts:320:10
   }
 
   switch (format) {
-    case 'avif':
+    case "":
       return AVIF
     case 'webp':

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:322:5
   switch (format) {
     case 'avif':
       return AVIF
-    case 'webp':
-      return WEBP
+    case 'webp':
     case 'png':
       return PNG

[Survived] StringLiteral
next/src/server/image-optimizer.ts:322:10
   switch (format) {
     case 'avif':
       return AVIF
-    case 'webp':
+    case "":
       return WEBP
     case 'png':

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:324:5
       return AVIF
     case 'webp':
       return WEBP
-    case 'png':
-      return PNG
+    case 'png':
     case 'jpeg':
     case 'jpg':

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:327:5
     case 'png':
       return PNG
     case 'jpeg':
-    case 'jpg':
-      return JPEG
+    case 'jpg':
     case 'gif':
       return GIF

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:329:5
     case 'jpeg':
     case 'jpg':
       return JPEG
-    case 'gif':
-      return GIF
+    case 'gif':
     case 'svg':
       return SVG

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:331:5
       return JPEG
     case 'gif':
       return GIF
-    case 'svg':
-      return SVG
+    case 'svg':
     case 'jxl':
     case 'jxl-stream':
killedBy: detectContentType with imgOptSkipMetadata: false should return svg when starts with space
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/svg+xml"
Received: "image/jxl"

[Killed] StringLiteral
next/src/server/image-optimizer.ts:331:10
       return JPEG
     case 'gif':
       return GIF
-    case 'svg':
+    case "":
       return SVG
     case 'jxl':
killedBy: detectContentType with imgOptSkipMetadata: false should return svg when starts with space
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/svg+xml"
Received: null

[Survived] StringLiteral
next/src/server/image-optimizer.ts:333:10
       return GIF
     case 'svg':
       return SVG
-    case 'jxl':
+    case "":
     case 'jxl-stream':
       return JXL

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:334:5
     case 'svg':
       return SVG
     case 'jxl':
-    case 'jxl-stream':
-      return JXL
+    case 'jxl-stream':
     case 'jp2':
       return JP2

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:336:5
     case 'jxl':
     case 'jxl-stream':
       return JXL
-    case 'jp2':
-      return JP2
+    case 'jp2':
     case 'tiff':
     case 'tif':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:338:10
       return JXL
     case 'jp2':
       return JP2
-    case 'tiff':
+    case "":
     case 'tif':
       return TIFF

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:339:5
     case 'jp2':
       return JP2
     case 'tiff':
-    case 'tif':
-      return TIFF
+    case 'tif':
     case 'pdf':
       return PDF

[Survived] StringLiteral
next/src/server/image-optimizer.ts:339:10
     case 'jp2':
       return JP2
     case 'tiff':
-    case 'tif':
+    case "":
       return TIFF
     case 'pdf':

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:341:5
     case 'tiff':
     case 'tif':
       return TIFF
-    case 'pdf':
-      return PDF
+    case 'pdf':
     case 'bmp':
       return BMP

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:343:5
       return TIFF
     case 'pdf':
       return PDF
-    case 'bmp':
-      return BMP
+    case 'bmp':
     case 'ico':
       return ICO

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:345:5
       return PDF
     case 'bmp':
       return BMP
-    case 'ico':
-      return ICO
+    case 'ico':
     case 'icns':
       return ICNS

[Survived] StringLiteral
next/src/server/image-optimizer.ts:345:10
       return PDF
     case 'bmp':
       return BMP
-    case 'ico':
+    case "":
       return ICO
     case 'icns':

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:347:5
       return BMP
     case 'ico':
       return ICO
-    case 'icns':
-      return ICNS
+    case 'icns':
     case 'dcraw':
     case 'dz':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:350:10
     case 'icns':
       return ICNS
     case 'dcraw':
-    case 'dz':
+    case "":
     case 'exr':
     case 'fits':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:351:10
       return ICNS
     case 'dcraw':
     case 'dz':
-    case 'exr':
+    case "":
     case 'fits':
     case 'heif':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:355:10
     case 'fits':
     case 'heif':
     case 'input':
-    case 'magick':
+    case "":
     case 'openslide':
     case 'ppm':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:356:10
     case 'heif':
     case 'input':
     case 'magick':
-    case 'openslide':
+    case "":
     case 'ppm':
     case 'rad':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:357:10
     case 'input':
     case 'magick':
     case 'openslide':
-    case 'ppm':
+    case "":
     case 'rad':
     case 'raw':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:361:10
     case 'rad':
     case 'raw':
     case 'v':
-    case 'cur':
+    case "":
     case 'dds':
     case 'j2c':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:362:10
     case 'raw':
     case 'v':
     case 'cur':
-    case 'dds':
+    case "":
     case 'j2c':
     case 'ktx':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:364:10
     case 'cur':
     case 'dds':
     case 'j2c':
-    case 'ktx':
+    case "":
     case 'pnm':
     case 'psd':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:365:10
     case 'dds':
     case 'j2c':
     case 'ktx':
-    case 'pnm':
+    case "":
     case 'psd':
     case 'tga':

[Survived] StringLiteral
next/src/server/image-optimizer.ts:367:10
     case 'ktx':
     case 'pnm':
     case 'psd':
-    case 'tga':
+    case "":
     case undefined:
     default:

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:369:5
     case 'psd':
     case 'tga':
     case undefined:
-    default:
-      return null
+    default:
   }
 }
killedBy: detectContentType with imgOptSkipMetadata: false should return null for unrecognized buffer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[NoCoverage] ArrayDeclaration
next/src/server/image-optimizer.ts:389:21
   ): ImageParamsResult | { errorMessage: string } {
     const imageData = nextConfig.images
     const {
-      deviceSizes = [],
+      deviceSizes = ["Stryker was here"],
       imageSizes = [],
       domains = [],

[NoCoverage] ArrayDeclaration
next/src/server/image-optimizer.ts:391:17
     const {
       deviceSizes = [],
       imageSizes = [],
-      domains = [],
+      domains = ["Stryker was here"],
       minimumCacheTTL = 14400,
       formats = ['image/webp'],

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:395:28
       minimumCacheTTL = 14400,
       formats = ['image/webp'],
     } = imageData
-    const remotePatterns = nextConfig.images?.remotePatterns || []
+    const remotePatterns = nextConfig.images.remotePatterns || []
     const localPatterns = nextConfig.images?.localPatterns
     const qualities = nextConfig.images?.qualities

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:395:28
       minimumCacheTTL = 14400,
       formats = ['image/webp'],
     } = imageData
-    const remotePatterns = nextConfig.images?.remotePatterns || []
+    const remotePatterns = true
     const localPatterns = nextConfig.images?.localPatterns
     const qualities = nextConfig.images?.qualities

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:396:27
       formats = ['image/webp'],
     } = imageData
     const remotePatterns = nextConfig.images?.remotePatterns || []
-    const localPatterns = nextConfig.images?.localPatterns
+    const localPatterns = nextConfig.images.localPatterns
     const qualities = nextConfig.images?.qualities
     const { url, w, q } = query

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:397:23
     } = imageData
     const remotePatterns = nextConfig.images?.remotePatterns || []
     const localPatterns = nextConfig.images?.localPatterns
-    const qualities = nextConfig.images?.qualities
+    const qualities = nextConfig.images.qualities
     const { url, w, q } = query
     let href: string

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:401:29
     const { url, w, q } = query
     let href: string
 
-    if (domains.length > 0) {
-      Log.warnOnce(
-        'The "images.domains" configuration is deprecated. Please use "images.remotePatterns" configuration instead.'
-      )
-    }
+    if (domains.length > 0) {}
 
     if (!url) {

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:401:9
     const { url, w, q } = query
     let href: string
 
-    if (domains.length > 0) {
+    if (domains.length >= 0) {
       Log.warnOnce(
         'The "images.domains" configuration is deprecated. Please use "images.remotePatterns" configuration instead.'

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:407:15
       )
     }
 
-    if (!url) {
-      return { errorMessage: '"url" parameter is required' }
-    } else if (Array.isArray(url)) {
+    if (!url) {} else if (Array.isArray(url)) {
       return { errorMessage: '"url" parameter cannot be an array' }
     }

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:408:30
     }
 
     if (!url) {
-      return { errorMessage: '"url" parameter is required' }
+      return { errorMessage: "" }
     } else if (Array.isArray(url)) {
       return { errorMessage: '"url" parameter cannot be an array' }

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:408:14
     }
 
     if (!url) {
-      return { errorMessage: '"url" parameter is required' }
+      return {}
     } else if (Array.isArray(url)) {
       return { errorMessage: '"url" parameter cannot be an array' }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:409:16
 
     if (!url) {
       return { errorMessage: '"url" parameter is required' }
-    } else if (Array.isArray(url)) {
+    } else if (true) {
       return { errorMessage: '"url" parameter cannot be an array' }
     }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:409:36
 
     if (!url) {
       return { errorMessage: '"url" parameter is required' }
-    } else if (Array.isArray(url)) {
-      return { errorMessage: '"url" parameter cannot be an array' }
-    }
+    } else if (Array.isArray(url)) {}
 
     if (url.length > 3072) {

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:410:14
     if (!url) {
       return { errorMessage: '"url" parameter is required' }
     } else if (Array.isArray(url)) {
-      return { errorMessage: '"url" parameter cannot be an array' }
+      return {}
     }
 

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:413:9
       return { errorMessage: '"url" parameter cannot be an array' }
     }
 
-    if (url.length > 3072) {
+    if (url.length >= 3072) {
       return { errorMessage: '"url" parameter is too long' }
     }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:413:9
       return { errorMessage: '"url" parameter cannot be an array' }
     }
 
-    if (url.length > 3072) {
+    if (true) {
       return { errorMessage: '"url" parameter is too long' }
     }

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:414:30
     }
 
     if (url.length > 3072) {
-      return { errorMessage: '"url" parameter is too long' }
+      return { errorMessage: "" }
     }
 
