[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:417:9
       return { errorMessage: '"url" parameter is too long' }
     }
 
-    if (url.startsWith('//')) {
+    if (false) {
       return {
         errorMessage: '"url" parameter cannot be a protocol-relative URL (//)',

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:417:9
       return { errorMessage: '"url" parameter is too long' }
     }
 
-    if (url.startsWith('//')) {
+    if (url.endsWith('//')) {
       return {
         errorMessage: '"url" parameter cannot be a protocol-relative URL (//)',

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:418:14
     }
 
     if (url.startsWith('//')) {
-      return {
-        errorMessage: '"url" parameter cannot be a protocol-relative URL (//)',
-      }
+      return {}
     }
 

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:419:23
 
     if (url.startsWith('//')) {
       return {
-        errorMessage: '"url" parameter cannot be a protocol-relative URL (//)',
+        errorMessage: "",
       }
     }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:425:9
 
     let isAbsolute: boolean
 
-    if (url.startsWith('/')) {
+    if (true) {
       href = url
       isAbsolute = false

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:425:9
 
     let isAbsolute: boolean
 
-    if (url.startsWith('/')) {
+    if (url.endsWith('/')) {
       href = url
       isAbsolute = false

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:427:20
 
     if (url.startsWith('/')) {
       href = url
-      isAbsolute = false
+      isAbsolute = true
       if (
         /\/_next\/image($|\/)/.test(

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:429:9
       href = url
       isAbsolute = false
       if (
-        /\/_next\/image($|\/)/.test(
-          decodeURIComponent(parseUrl(url)?.pathname ?? '')
-        )
+        true
       ) {
         return {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:429:9
       href = url
       isAbsolute = false
       if (
-        /\/_next\/image($|\/)/.test(
-          decodeURIComponent(parseUrl(url)?.pathname ?? '')
-        )
+        false
       ) {
         return {

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:430:30
       isAbsolute = false
       if (
         /\/_next\/image($|\/)/.test(
-          decodeURIComponent(parseUrl(url)?.pathname ?? '')
+          decodeURIComponent(parseUrl(url).pathname ?? '')
         )
       ) {

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:430:30
       isAbsolute = false
       if (
         /\/_next\/image($|\/)/.test(
-          decodeURIComponent(parseUrl(url)?.pathname ?? '')
+          decodeURIComponent(parseUrl(url)?.pathname && '')
         )
       ) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:432:9
         /\/_next\/image($|\/)/.test(
           decodeURIComponent(parseUrl(url)?.pathname ?? '')
         )
-      ) {
-        return {
-          errorMessage: '"url" parameter cannot be recursive',
-        }
-      }
+      ) {}
       if (!hasLocalMatch(localPatterns, url)) {
         return { errorMessage: '"url" parameter is not allowed' }

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:433:16
           decodeURIComponent(parseUrl(url)?.pathname ?? '')
         )
       ) {
-        return {
-          errorMessage: '"url" parameter cannot be recursive',
-        }
+        return {}
       }
       if (!hasLocalMatch(localPatterns, url)) {

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:434:25
         )
       ) {
         return {
-          errorMessage: '"url" parameter cannot be recursive',
+          errorMessage: "",
         }
       }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:437:47
           errorMessage: '"url" parameter cannot be recursive',
         }
       }
-      if (!hasLocalMatch(localPatterns, url)) {
-        return { errorMessage: '"url" parameter is not allowed' }
-      }
+      if (!hasLocalMatch(localPatterns, url)) {}
     } else {
       let hrefParsed: URL

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:437:11
           errorMessage: '"url" parameter cannot be recursive',
         }
       }
-      if (!hasLocalMatch(localPatterns, url)) {
+      if (false) {
         return { errorMessage: '"url" parameter is not allowed' }
       }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:440:12
       if (!hasLocalMatch(localPatterns, url)) {
         return { errorMessage: '"url" parameter is not allowed' }
       }
-    } else {
-      let hrefParsed: URL
-
-      try {
-        hrefParsed = new URL(url)
-        href = hrefParsed.toString()
-        isAbsolute = true
-      } catch (_error) {
-        return { errorMessage: '"url" parameter is invalid' }
-      }
-
-      if (!['http:', 'https:'].includes(hrefParsed.protocol)) {
-        return { errorMessage: '"url" parameter is invalid' }
-      }
-
-      if (!hasRemoteMatch(domains, remotePatterns, hrefParsed)) {
-        return { errorMessage: '"url" parameter is not allowed' }
-      }
-    }
+    } else {}
 
     if (!w) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:443:11
     } else {
       let hrefParsed: URL
 
-      try {
-        hrefParsed = new URL(url)
-        href = hrefParsed.toString()
-        isAbsolute = true
-      } catch (_error) {
+      try {} catch (_error) {
         return { errorMessage: '"url" parameter is invalid' }
       }

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:446:22
       try {
         hrefParsed = new URL(url)
         href = hrefParsed.toString()
-        isAbsolute = true
+        isAbsolute = false
       } catch (_error) {
         return { errorMessage: '"url" parameter is invalid' }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:447:24
         hrefParsed = new URL(url)
         href = hrefParsed.toString()
         isAbsolute = true
-      } catch (_error) {
-        return { errorMessage: '"url" parameter is invalid' }
-      }
+      } catch (_error) {}
 
       if (!['http:', 'https:'].includes(hrefParsed.protocol)) {

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:448:16
         href = hrefParsed.toString()
         isAbsolute = true
       } catch (_error) {
-        return { errorMessage: '"url" parameter is invalid' }
+        return {}
       }
 

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:451:11
         return { errorMessage: '"url" parameter is invalid' }
       }
 
-      if (!['http:', 'https:'].includes(hrefParsed.protocol)) {
+      if (false) {
         return { errorMessage: '"url" parameter is invalid' }
       }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:451:11
         return { errorMessage: '"url" parameter is invalid' }
       }
 
-      if (!['http:', 'https:'].includes(hrefParsed.protocol)) {
+      if (true) {
         return { errorMessage: '"url" parameter is invalid' }
       }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:455:11
         return { errorMessage: '"url" parameter is invalid' }
       }
 
-      if (!hasRemoteMatch(domains, remotePatterns, hrefParsed)) {
+      if (false) {
         return { errorMessage: '"url" parameter is not allowed' }
       }

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:455:11
         return { errorMessage: '"url" parameter is invalid' }
       }
 
-      if (!hasRemoteMatch(domains, remotePatterns, hrefParsed)) {
+      if (hasRemoteMatch(domains, remotePatterns, hrefParsed)) {
         return { errorMessage: '"url" parameter is not allowed' }
       }

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:456:16
       }
 
       if (!hasRemoteMatch(domains, remotePatterns, hrefParsed)) {
-        return { errorMessage: '"url" parameter is not allowed' }
+        return {}
       }
     }

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:456:32
       }
 
       if (!hasRemoteMatch(domains, remotePatterns, hrefParsed)) {
-        return { errorMessage: '"url" parameter is not allowed' }
+        return { errorMessage: "" }
       }
     }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:460:9
       }
     }
 
-    if (!w) {
+    if (false) {
       return { errorMessage: '"w" parameter (width) is required' }
     } else if (Array.isArray(w)) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:460:13
       }
     }
 
-    if (!w) {
-      return { errorMessage: '"w" parameter (width) is required' }
-    } else if (Array.isArray(w)) {
+    if (!w) {} else if (Array.isArray(w)) {
       return { errorMessage: '"w" parameter (width) cannot be an array' }
     } else if (!/^[0-9]+$/.test(w)) {

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:461:30
     }
 
     if (!w) {
-      return { errorMessage: '"w" parameter (width) is required' }
+      return { errorMessage: "" }
     } else if (Array.isArray(w)) {
       return { errorMessage: '"w" parameter (width) cannot be an array' }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:462:34
 
     if (!w) {
       return { errorMessage: '"w" parameter (width) is required' }
-    } else if (Array.isArray(w)) {
-      return { errorMessage: '"w" parameter (width) cannot be an array' }
-    } else if (!/^[0-9]+$/.test(w)) {
+    } else if (Array.isArray(w)) {} else if (!/^[0-9]+$/.test(w)) {
       return {
         errorMessage: '"w" parameter (width) must be an integer greater than 0',

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:462:16
 
     if (!w) {
       return { errorMessage: '"w" parameter (width) is required' }
-    } else if (Array.isArray(w)) {
+    } else if (false) {
       return { errorMessage: '"w" parameter (width) cannot be an array' }
     } else if (!/^[0-9]+$/.test(w)) {

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:463:14
     if (!w) {
       return { errorMessage: '"w" parameter (width) is required' }
     } else if (Array.isArray(w)) {
-      return { errorMessage: '"w" parameter (width) cannot be an array' }
+      return {}
     } else if (!/^[0-9]+$/.test(w)) {
       return {

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:463:30
     if (!w) {
       return { errorMessage: '"w" parameter (width) is required' }
     } else if (Array.isArray(w)) {
-      return { errorMessage: '"w" parameter (width) cannot be an array' }
+      return { errorMessage: "" }
     } else if (!/^[0-9]+$/.test(w)) {
       return {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:464:37
       return { errorMessage: '"w" parameter (width) is required' }
     } else if (Array.isArray(w)) {
       return { errorMessage: '"w" parameter (width) cannot be an array' }
-    } else if (!/^[0-9]+$/.test(w)) {
-      return {
-        errorMessage: '"w" parameter (width) must be an integer greater than 0',
-      }
-    }
+    } else if (!/^[0-9]+$/.test(w)) {}
 
     if (!q) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:464:16
       return { errorMessage: '"w" parameter (width) is required' }
     } else if (Array.isArray(w)) {
       return { errorMessage: '"w" parameter (width) cannot be an array' }
-    } else if (!/^[0-9]+$/.test(w)) {
+    } else if (true) {
       return {
         errorMessage: '"w" parameter (width) must be an integer greater than 0',

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:470:9
       }
     }
 
-    if (!q) {
+    if (false) {
       return { errorMessage: '"q" parameter (quality) is required' }
     } else if (Array.isArray(q)) {

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:471:30
     }
 
     if (!q) {
-      return { errorMessage: '"q" parameter (quality) is required' }
+      return { errorMessage: "" }
     } else if (Array.isArray(q)) {
       return { errorMessage: '"q" parameter (quality) cannot be an array' }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:472:16
 
     if (!q) {
       return { errorMessage: '"q" parameter (quality) is required' }
-    } else if (Array.isArray(q)) {
+    } else if (true) {
       return { errorMessage: '"q" parameter (quality) cannot be an array' }
     } else if (!/^[0-9]+$/.test(q)) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:472:34
 
     if (!q) {
       return { errorMessage: '"q" parameter (quality) is required' }
-    } else if (Array.isArray(q)) {
-      return { errorMessage: '"q" parameter (quality) cannot be an array' }
-    } else if (!/^[0-9]+$/.test(q)) {
+    } else if (Array.isArray(q)) {} else if (!/^[0-9]+$/.test(q)) {
       return {
         errorMessage:

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:474:16
       return { errorMessage: '"q" parameter (quality) is required' }
     } else if (Array.isArray(q)) {
       return { errorMessage: '"q" parameter (quality) cannot be an array' }
-    } else if (!/^[0-9]+$/.test(q)) {
+    } else if (/^[0-9]+$/.test(q)) {
       return {
         errorMessage:

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:474:37
       return { errorMessage: '"q" parameter (quality) is required' }
     } else if (Array.isArray(q)) {
       return { errorMessage: '"q" parameter (quality) cannot be an array' }
-    } else if (!/^[0-9]+$/.test(q)) {
-      return {
-        errorMessage:
-          '"q" parameter (quality) must be an integer between 1 and 100',
-      }
-    }
+    } else if (!/^[0-9]+$/.test(q)) {}
 
     const width = parseInt(w, 10)

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:475:14
     } else if (Array.isArray(q)) {
       return { errorMessage: '"q" parameter (quality) cannot be an array' }
     } else if (!/^[0-9]+$/.test(q)) {
-      return {
-        errorMessage:
-          '"q" parameter (quality) must be an integer between 1 and 100',
-      }
+      return {}
     }
 

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:483:9
 
     const width = parseInt(w, 10)
 
-    if (width <= 0 || isNaN(width)) {
+    if (true) {
       return {
         errorMessage: '"w" parameter (width) must be an integer greater than 0',

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:483:37
 
     const width = parseInt(w, 10)
 
-    if (width <= 0 || isNaN(width)) {
-      return {
-        errorMessage: '"w" parameter (width) must be an integer greater than 0',
-      }
-    }
+    if (width <= 0 || isNaN(width)) {}
 
     const sizes = [...(deviceSizes || []), ...(imageSizes || [])]

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:489:48
       }
     }
 
-    const sizes = [...(deviceSizes || []), ...(imageSizes || [])]
+    const sizes = [...(deviceSizes || []), ...(true)]
 
     if (isDev) {

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:489:24
       }
     }
 
-    const sizes = [...(deviceSizes || []), ...(imageSizes || [])]
+    const sizes = [...(deviceSizes && []), ...(imageSizes || [])]
 
     if (isDev) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:491:16
 
     const sizes = [...(deviceSizes || []), ...(imageSizes || [])]
 
-    if (isDev) {
-      sizes.push(BLUR_IMG_SIZE)
-    }
+    if (isDev) {}
 
     const isValidSize =

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:496:7
     }
 
     const isValidSize =
-      sizes.includes(width) || (isDev && width <= BLUR_IMG_SIZE)
+      sizes.includes(width) && isDev && width <= BLUR_IMG_SIZE
 
     if (!isValidSize) {

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:496:42
     }
 
     const isValidSize =
-      sizes.includes(width) || (isDev && width <= BLUR_IMG_SIZE)
+      sizes.includes(width) || (isDev && width < BLUR_IMG_SIZE)
 
     if (!isValidSize) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:498:23
     const isValidSize =
       sizes.includes(width) || (isDev && width <= BLUR_IMG_SIZE)
 
-    if (!isValidSize) {
-      return {
-        errorMessage: `"w" parameter (width) of ${width} is not allowed`,
-      }
-    }
+    if (!isValidSize) {}
 
     const quality = parseInt(q, 10)

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:498:9
     const isValidSize =
       sizes.includes(width) || (isDev && width <= BLUR_IMG_SIZE)
 
-    if (!isValidSize) {
+    if (isValidSize) {
       return {
         errorMessage: `"w" parameter (width) of ${width} is not allowed`,

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:499:14
       sizes.includes(width) || (isDev && width <= BLUR_IMG_SIZE)
 
     if (!isValidSize) {
-      return {
-        errorMessage: `"w" parameter (width) of ${width} is not allowed`,
-      }
+      return {}
     }
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:506:57
 
     const quality = parseInt(q, 10)
 
-    if (isNaN(quality) || quality < 1 || quality > 100) {
-      return {
-        errorMessage:
-          '"q" parameter (quality) must be an integer between 1 and 100',
-      }
-    }
+    if (isNaN(quality) || quality < 1 || quality > 100) {}
 
     if (qualities) {

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:506:27
 
     const quality = parseInt(q, 10)
 
-    if (isNaN(quality) || quality < 1 || quality > 100) {
+    if (isNaN(quality) || quality <= 1 || quality > 100) {
       return {
         errorMessage:

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:507:14
     const quality = parseInt(q, 10)
 
     if (isNaN(quality) || quality < 1 || quality > 100) {
-      return {
-        errorMessage:
-          '"q" parameter (quality) must be an integer between 1 and 100',
-      }
+      return {}
     }
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:513:20
       }
     }
 
-    if (qualities) {
-      if (isDev) {
-        qualities.push(BLUR_QUALITY)
-      }
-
-      if (!qualities.includes(quality)) {
-        return {
-          errorMessage: `"q" parameter (quality) of ${q} is not allowed`,
-        }
-      }
-    }
+    if (qualities) {}
 
     const mimeType = getSupportedMimeType(formats || [], req.headers['accept'])

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:513:9
       }
     }
 
-    if (qualities) {
+    if (false) {
       if (isDev) {
         qualities.push(BLUR_QUALITY)

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:514:11
     }
 
     if (qualities) {
-      if (isDev) {
+      if (true) {
         qualities.push(BLUR_QUALITY)
       }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:514:18
     }
 
     if (qualities) {
-      if (isDev) {
-        qualities.push(BLUR_QUALITY)
-      }
+      if (isDev) {}
 
       if (!qualities.includes(quality)) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:518:11
         qualities.push(BLUR_QUALITY)
       }
 
-      if (!qualities.includes(quality)) {
+      if (true) {
         return {
           errorMessage: `"q" parameter (quality) of ${q} is not allowed`,

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:518:41
         qualities.push(BLUR_QUALITY)
       }
 
-      if (!qualities.includes(quality)) {
-        return {
-          errorMessage: `"q" parameter (quality) of ${q} is not allowed`,
-        }
-      }
+      if (!qualities.includes(quality)) {}
     }
 

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:519:16
       }
 
       if (!qualities.includes(quality)) {
-        return {
-          errorMessage: `"q" parameter (quality) of ${q} is not allowed`,
-        }
+        return {}
       }
     }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:525:43
       }
     }
 
-    const mimeType = getSupportedMimeType(formats || [], req.headers['accept'])
+    const mimeType = getSupportedMimeType(true, req.headers['accept'])
 
     const isStatic = url.startsWith(

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:525:43
       }
     }
 
-    const mimeType = getSupportedMimeType(formats || [], req.headers['accept'])
+    const mimeType = getSupportedMimeType(false, req.headers['accept'])
 
     const isStatic = url.startsWith(

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:527:22
 
     const mimeType = getSupportedMimeType(formats || [], req.headers['accept'])
 
-    const isStatic = url.startsWith(
-      `${nextConfig.basePath || ''}/_next/static/media`
-    )
+    const isStatic = url.endsWith(`${nextConfig.basePath || ''}/_next/static/media`)
 
     return {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:528:10
     const mimeType = getSupportedMimeType(formats || [], req.headers['accept'])
 
     const isStatic = url.startsWith(
-      `${nextConfig.basePath || ''}/_next/static/media`
+      `${true}/_next/static/media`
     )
 

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:528:10
     const mimeType = getSupportedMimeType(formats || [], req.headers['accept'])
 
     const isStatic = url.startsWith(
-      `${nextConfig.basePath || ''}/_next/static/media`
+      `${nextConfig.basePath && ''}/_next/static/media`
     )
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:553:14
     width: number
     quality: number
     mimeType: string
-  }): string {
-    return getHash([CACHE_VERSION, href, width, quality, mimeType])
-  }
+  }): string {}
 
   constructor({

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:565:6
     distDir: string
     nextConfig: NextConfigRuntime
     cacheHandler?: CacheHandler
-  }) {
-    this.cacheDir = join(/* turbopackIgnore: true */ distDir, 'cache', 'images')
-    this.nextConfig = nextConfig
-    this.cacheHandler = cacheHandler
-
-    // Eagerly start LRU initialization for filesystem cache
-    if (
-      !cacheHandler &&
-      nextConfig.images.maximumDiskCacheSize !== 0 &&
-      nextConfig.experimental.isrFlushToDisk
-    ) {
-      this.isDiskCacheEnabled = true
-      this.cacheDiskLRU = getOrInitDiskLRU(
-        this.cacheDir,
-        nextConfig.images.maximumDiskCacheSize,
-        initCacheEntries,
-        deleteFromCacheDir
-      )
-    }
-  }
+  }) {}
 
   async get(cacheKey: string): Promise<IncrementalResponseCacheEntry | null> {

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:566:72
     nextConfig: NextConfigRuntime
     cacheHandler?: CacheHandler
   }) {
-    this.cacheDir = join(/* turbopackIgnore: true */ distDir, 'cache', 'images')
+    this.cacheDir = join(/* turbopackIgnore: true */ distDir, 'cache', "")
     this.nextConfig = nextConfig
     this.cacheHandler = cacheHandler

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:572:7
 
     // Eagerly start LRU initialization for filesystem cache
     if (
-      !cacheHandler &&
+      cacheHandler &&
       nextConfig.images.maximumDiskCacheSize !== 0 &&
       nextConfig.experimental.isrFlushToDisk

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:572:7
 
     // Eagerly start LRU initialization for filesystem cache
     if (
-      !cacheHandler &&
-      nextConfig.images.maximumDiskCacheSize !== 0 &&
-      nextConfig.experimental.isrFlushToDisk
+      !cacheHandler && nextConfig.images.maximumDiskCacheSize !== 0 || nextConfig.experimental.isrFlushToDisk
     ) {
       this.isDiskCacheEnabled = true

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:573:7
     // Eagerly start LRU initialization for filesystem cache
     if (
       !cacheHandler &&
-      nextConfig.images.maximumDiskCacheSize !== 0 &&
+      nextConfig.images.maximumDiskCacheSize === 0 &&
       nextConfig.experimental.isrFlushToDisk
     ) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:573:7
     // Eagerly start LRU initialization for filesystem cache
     if (
       !cacheHandler &&
-      nextConfig.images.maximumDiskCacheSize !== 0 &&
+      true &&
       nextConfig.experimental.isrFlushToDisk
     ) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:575:7
       !cacheHandler &&
       nextConfig.images.maximumDiskCacheSize !== 0 &&
       nextConfig.experimental.isrFlushToDisk
-    ) {
-      this.isDiskCacheEnabled = true
-      this.cacheDiskLRU = getOrInitDiskLRU(
-        this.cacheDir,
-        nextConfig.images.maximumDiskCacheSize,
-        initCacheEntries,
-        deleteFromCacheDir
-      )
-    }
+    ) {}
   }
 

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:576:33
       nextConfig.images.maximumDiskCacheSize !== 0 &&
       nextConfig.experimental.isrFlushToDisk
     ) {
-      this.isDiskCacheEnabled = true
+      this.isDiskCacheEnabled = false
       this.cacheDiskLRU = getOrInitDiskLRU(
         this.cacheDir,

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:588:9
 
   async get(cacheKey: string): Promise<IncrementalResponseCacheEntry | null> {
     // If a custom cache handler is provided, use it
-    if (this.cacheHandler) {
+    if (true) {
       try {
         const cacheData = await this.cacheHandler.get(cacheKey, {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:588:9
 
   async get(cacheKey: string): Promise<IncrementalResponseCacheEntry | null> {
     // If a custom cache handler is provided, use it
-    if (this.cacheHandler) {
+    if (false) {
       try {
         const cacheData = await this.cacheHandler.get(cacheKey, {

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:590:65
     // If a custom cache handler is provided, use it
     if (this.cacheHandler) {
       try {
-        const cacheData = await this.cacheHandler.get(cacheKey, {
-          kind: IncrementalCacheKind.IMAGE,
-          isFallback: false,
-        })
+        const cacheData = await this.cacheHandler.get(cacheKey, {})
 
         if (!cacheData?.value) {

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:592:23
       try {
         const cacheData = await this.cacheHandler.get(cacheKey, {
           kind: IncrementalCacheKind.IMAGE,
-          isFallback: false,
+          isFallback: true,
         })
 

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:595:14
           isFallback: false,
         })
 
-        if (!cacheData?.value) {
+        if (!cacheData.value) {
           return null
         }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:595:13
           isFallback: false,
         })
 
-        if (!cacheData?.value) {
+        if (false) {
           return null
         }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:599:61
           return null
         }
 
-        if (cacheData.value.kind !== CachedRouteKind.IMAGE) {
-          return null
-        }
+        if (cacheData.value.kind !== CachedRouteKind.IMAGE) {}
 
         const now = Date.now()

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:599:13
           return null
         }
 
-        if (cacheData.value.kind !== CachedRouteKind.IMAGE) {
+        if (cacheData.value.kind === CachedRouteKind.IMAGE) {
           return null
         }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:604:30
         }
 
         const now = Date.now()
-        const lastModified = cacheData.lastModified || now
+        const lastModified = false
         const revalidate =
           typeof cacheData.value.revalidate === 'number'

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:604:30
         }
 
         const now = Date.now()
-        const lastModified = cacheData.lastModified || now
+        const lastModified = true
         const revalidate =
           typeof cacheData.value.revalidate === 'number'

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:606:11
         const now = Date.now()
         const lastModified = cacheData.lastModified || now
         const revalidate =
-          typeof cacheData.value.revalidate === 'number'
+          true
             ? cacheData.value.revalidate
             : this.nextConfig.images.minimumCacheTTL

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:606:11
         const now = Date.now()
         const lastModified = cacheData.lastModified || now
         const revalidate =
-          typeof cacheData.value.revalidate === 'number'
+          typeof cacheData.value.revalidate !== 'number'
             ? cacheData.value.revalidate
             : this.nextConfig.images.minimumCacheTTL

[NoCoverage] ArithmeticOperator
next/src/server/image-optimizer.ts:610:11
             ? cacheData.value.revalidate
             : this.nextConfig.images.minimumCacheTTL
         const revalidateAfter =
-          Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 +
-          lastModified
+          Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 - lastModified
         const isStale = revalidateAfter < now
 

[NoCoverage] ArithmeticOperator
next/src/server/image-optimizer.ts:610:11
             ? cacheData.value.revalidate
             : this.nextConfig.images.minimumCacheTTL
         const revalidateAfter =
-          Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 +
+          Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) / 1000 +
           lastModified
         const isStale = revalidateAfter < now
