[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:612:25
         const revalidateAfter =
           Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 +
           lastModified
-        const isStale = revalidateAfter < now
+        const isStale = false
 
         return {

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:612:25
         const revalidateAfter =
           Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 +
           lastModified
-        const isStale = revalidateAfter < now
+        const isStale = revalidateAfter <= now
 
         return {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:627:35
     }
 
     // If the filesystem cache is disabled, return early
-    if (!this.isDiskCacheEnabled) {
-      return null
-    }
+    if (!this.isDiskCacheEnabled) {}
 
     // Fall back to filesystem cache

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:627:9
     }
 
     // If the filesystem cache is disabled, return early
-    if (!this.isDiskCacheEnabled) {
+    if (false) {
       return null
     }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:632:9
     }
 
     // Fall back to filesystem cache
-    try {
-      const now = Date.now()
-      const { maxAge, expireAt, etag, upstreamEtag, buffer, extension } =
-        await readFromCacheDir(this.cacheDir, cacheKey)
-
-      // Promote entry in LRU (mark as recently used)
-      const lru = await this.cacheDiskLRU
-      lru?.get(cacheKey)
-
-      return {
-        value: {
-          kind: CachedRouteKind.IMAGE,
-          etag,
-          buffer,
-          extension,
-          upstreamEtag,
-        },
-        revalidateAfter:
-          Math.max(maxAge, this.nextConfig.images.minimumCacheTTL) * 1000 +
-          Date.now(),
-        cacheControl: { revalidate: maxAge, expire: undefined },
-        isStale: now > expireAt,
-      }
-    } catch (_) {
+    try {} catch (_) {
       // failed to read from cache dir, treat as cache miss
     }

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:639:7
 
       // Promote entry in LRU (mark as recently used)
       const lru = await this.cacheDiskLRU
-      lru?.get(cacheKey)
+      lru.get(cacheKey)
 
       return {

[NoCoverage] ArithmeticOperator
next/src/server/image-optimizer.ts:650:11
           upstreamEtag,
         },
         revalidateAfter:
-          Math.max(maxAge, this.nextConfig.images.minimumCacheTTL) * 1000 +
-          Date.now(),
+          Math.max(maxAge, this.nextConfig.images.minimumCacheTTL) * 1000 - Date.now(),
         cacheControl: { revalidate: maxAge, expire: undefined },
         isStale: now > expireAt,

[NoCoverage] ArithmeticOperator
next/src/server/image-optimizer.ts:650:11
           upstreamEtag,
         },
         revalidateAfter:
-          Math.max(maxAge, this.nextConfig.images.minimumCacheTTL) * 1000 +
+          Math.max(maxAge, this.nextConfig.images.minimumCacheTTL) / 1000 +
           Date.now(),
         cacheControl: { revalidate: maxAge, expire: undefined },

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:652:23
         revalidateAfter:
           Math.max(maxAge, this.nextConfig.images.minimumCacheTTL) * 1000 +
           Date.now(),
-        cacheControl: { revalidate: maxAge, expire: undefined },
+        cacheControl: {},
         isStale: now > expireAt,
       }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:653:18
           Math.max(maxAge, this.nextConfig.images.minimumCacheTTL) * 1000 +
           Date.now(),
         cacheControl: { revalidate: maxAge, expire: undefined },
-        isStale: now > expireAt,
+        isStale: true,
       }
     } catch (_) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:653:18
           Math.max(maxAge, this.nextConfig.images.minimumCacheTTL) * 1000 +
           Date.now(),
         cacheControl: { revalidate: maxAge, expire: undefined },
-        isStale: now > expireAt,
+        isStale: false,
       }
     } catch (_) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:669:48
       cacheControl?: CacheControl
     }
   ) {
-    if (value?.kind !== CachedRouteKind.IMAGE) {
-      throw new Error('invariant attempted to set non-image to image-cache')
-    }
+    if (value?.kind !== CachedRouteKind.IMAGE) {}
 
     const revalidate = cacheControl?.revalidate

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:669:9
       cacheControl?: CacheControl
     }
   ) {
-    if (value?.kind !== CachedRouteKind.IMAGE) {
+    if (value?.kind === CachedRouteKind.IMAGE) {
       throw new Error('invariant attempted to set non-image to image-cache')
     }

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:673:24
       throw new Error('invariant attempted to set non-image to image-cache')
     }
 
-    const revalidate = cacheControl?.revalidate
+    const revalidate = cacheControl.revalidate
 
     if (typeof revalidate !== 'number') {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:675:9
 
     const revalidate = cacheControl?.revalidate
 
-    if (typeof revalidate !== 'number') {
+    if (true) {
       throw new InvariantError('revalidate must be a number for image-cache')
     }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:675:41
 
     const revalidate = cacheControl?.revalidate
 
-    if (typeof revalidate !== 'number') {
-      throw new InvariantError('revalidate must be a number for image-cache')
-    }
+    if (typeof revalidate !== 'number') {}
 
     // If a custom cache handler is provided, use it

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:676:32
     const revalidate = cacheControl?.revalidate
 
     if (typeof revalidate !== 'number') {
-      throw new InvariantError('revalidate must be a number for image-cache')
+      throw new InvariantError("")
     }
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:681:11
 
     // If a custom cache handler is provided, use it
     if (this.cacheHandler) {
-      try {
-        // Apply minimumCacheTTL at write time, similar to the implementation in the fallback filesystem cache
-        const effectiveRevalidate = Math.max(
-          revalidate,
-          this.nextConfig.images.minimumCacheTTL
-        )
-        const valueWithRevalidate = {
-          ...value,
-          revalidate: effectiveRevalidate,
-        }
-        await this.cacheHandler.set(cacheKey, valueWithRevalidate, {
-          cacheControl: {
-            revalidate: effectiveRevalidate,
-            expire: cacheControl?.expire,
-          },
-        })
-      } catch (err) {
+      try {} catch (err) {
         Log.error(`Failed to write image to custom cache ${cacheKey}`, err)
       }

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:683:37
     if (this.cacheHandler) {
       try {
         // Apply minimumCacheTTL at write time, similar to the implementation in the fallback filesystem cache
-        const effectiveRevalidate = Math.max(
-          revalidate,
-          this.nextConfig.images.minimumCacheTTL
-        )
+        const effectiveRevalidate = Math.min(revalidate, this.nextConfig.images.minimumCacheTTL)
         const valueWithRevalidate = {
           ...value,

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:694:21
         await this.cacheHandler.set(cacheKey, valueWithRevalidate, {
           cacheControl: {
             revalidate: effectiveRevalidate,
-            expire: cacheControl?.expire,
+            expire: cacheControl.expire,
           },
         })

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:697:21
             expire: cacheControl?.expire,
           },
         })
-      } catch (err) {
-        Log.error(`Failed to write image to custom cache ${cacheKey}`, err)
-      }
+      } catch (err) {}
       return
     }

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:698:19
           },
         })
       } catch (err) {
-        Log.error(`Failed to write image to custom cache ${cacheKey}`, err)
+        Log.error(``, err)
       }
       return

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:704:9
     }
 
     // If the filesystem cache is disabled, return early
-    if (!this.isDiskCacheEnabled) {
+    if (true) {
       return
     }

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:704:9
     }
 
     // If the filesystem cache is disabled, return early
-    if (!this.isDiskCacheEnabled) {
+    if (this.isDiskCacheEnabled) {
       return
     }

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:710:7
 
     // Fall back to filesystem cache
     const expireAt =
-      Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 +
+      Math.min(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 +
       Date.now()
 

[NoCoverage] ArithmeticOperator
next/src/server/image-optimizer.ts:710:7
 
     // Fall back to filesystem cache
     const expireAt =
-      Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 +
+      Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) / 1000 +
       Date.now()
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:713:9
       Math.max(revalidate, this.nextConfig.images.minimumCacheTTL) * 1000 +
       Date.now()
 
-    try {
-      const lru = await this.cacheDiskLRU
-      const success = lru?.set(cacheKey, value.buffer.byteLength)
-      if (success === false) {
-        throw new Error(
-          `image of size ${value.buffer.byteLength} could not be tracked by lru cache`
-        )
-      }
-
-      await writeToCacheDir(
-        this.cacheDir,
-        cacheKey,
-        value.extension,
-        revalidate,
-        expireAt,
-        value.buffer,
-        value.etag,
-        value.upstreamEtag
-      )
-    } catch (err) {
+    try {} catch (err) {
       Log.error(`Failed to write image to cache ${cacheKey}`, err)
     }

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:715:23
 
     try {
       const lru = await this.cacheDiskLRU
-      const success = lru?.set(cacheKey, value.buffer.byteLength)
+      const success = lru.set(cacheKey, value.buffer.byteLength)
       if (success === false) {
         throw new Error(

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:716:11
     try {
       const lru = await this.cacheDiskLRU
       const success = lru?.set(cacheKey, value.buffer.byteLength)
-      if (success === false) {
+      if (success !== false) {
         throw new Error(
           `image of size ${value.buffer.byteLength} could not be tracked by lru cache`

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:716:11
     try {
       const lru = await this.cacheDiskLRU
       const success = lru?.set(cacheKey, value.buffer.byteLength)
-      if (success === false) {
+      if (false) {
         throw new Error(
           `image of size ${value.buffer.byteLength} could not be tracked by lru cache`

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:732:19
         value.etag,
         value.upstreamEtag
       )
-    } catch (err) {
-      Log.error(`Failed to write image to cache ${cacheKey}`, err)
-    }
+    } catch (err) {}
   }
 }

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:733:17
         value.upstreamEtag
       )
     } catch (err) {
-      Log.error(`Failed to write image to cache ${cacheKey}`, err)
+      Log.error(``, err)
     }
   }

[Killed] BlockStatement
next/src/server/image-optimizer.ts:740:52
 export class ImageError extends Error {
   statusCode: number
 
-  constructor(statusCode: number, message: string) {
-    super(message)
-
-    // ensure an error status is used > 400
-    if (statusCode >= 400) {
-      this.statusCode = statusCode
-    } else {
-      this.statusCode = 500
-    }
-  }
+  constructor(statusCode: number, message: string) {}
 }
 
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ImageError
Received constructor: ReferenceError

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:744:9
     super(message)
 
     // ensure an error status is used > 400
-    if (statusCode >= 400) {
+    if (false) {
       this.statusCode = statusCode
     } else {
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:744:9
     super(message)
 
     // ensure an error status is used > 400
-    if (statusCode >= 400) {
+    if (statusCode < 400) {
       this.statusCode = statusCode
     } else {
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:746:12
     // ensure an error status is used > 400
     if (statusCode >= 400) {
       this.statusCode = statusCode
-    } else {
-      this.statusCode = 500
-    }
+    } else {}
   }
 }

[Killed] BlockStatement
next/src/server/image-optimizer.ts:754:24
 
 function parseCacheControl(
   str: string | null | undefined
-): Map<string, string> {
-  const map = new Map<string, string>()
-  if (!str) {
-    return map
-  }
-  for (let directive of str.split(',')) {
-    let [key, value] = directive.trim().split('=', 2)
-    key = key.toLowerCase()
-    if (value) {
-      value = value.toLowerCase()
-    }
-    map.set(key, value)
-  }
-  return map
-}
+): Map<string, string> {}
 
 export function getMaxAge(str: string | null | undefined): number {
killedBy: getMaxAge should return cache-control max-age lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:756:7
   str: string | null | undefined
 ): Map<string, string> {
   const map = new Map<string, string>()
-  if (!str) {
+  if (true) {
     return map
   }
killedBy: getMaxAge should return cache-control max-age lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] BooleanLiteral
next/src/server/image-optimizer.ts:756:7
   str: string | null | undefined
 ): Map<string, string> {
   const map = new Map<string, string>()
-  if (!str) {
+  if (str) {
     return map
   }
killedBy: getMaxAge should return 0 when no cache-control provided
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
next/src/server/image-optimizer.ts:759:41
   if (!str) {
     return map
   }
-  for (let directive of str.split(',')) {
-    let [key, value] = directive.trim().split('=', 2)
-    key = key.toLowerCase()
-    if (value) {
-      value = value.toLowerCase()
-    }
-    map.set(key, value)
-  }
+  for (let directive of str.split(',')) {}
   return map
 }
killedBy: getMaxAge should return cache-control max-age lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] MethodExpression
next/src/server/image-optimizer.ts:760:24
     return map
   }
   for (let directive of str.split(',')) {
-    let [key, value] = directive.trim().split('=', 2)
+    let [key, value] = directive.split('=', 2)
     key = key.toLowerCase()
     if (value) {
killedBy: getMaxAge should return cache-control s-maxage with spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] MethodExpression
next/src/server/image-optimizer.ts:761:11
   }
   for (let directive of str.split(',')) {
     let [key, value] = directive.trim().split('=', 2)
-    key = key.toLowerCase()
+    key = key.toUpperCase()
     if (value) {
       value = value.toLowerCase()
killedBy: getMaxAge should return cache-control max-age lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:762:9
   for (let directive of str.split(',')) {
     let [key, value] = directive.trim().split('=', 2)
     key = key.toLowerCase()
-    if (value) {
+    if (true) {
       value = value.toLowerCase()
     }
killedBy: getMaxAge should return 0 when cache-control is no-cache
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Survived] ConditionalExpression
next/src/server/image-optimizer.ts:762:9
   for (let directive of str.split(',')) {
     let [key, value] = directive.trim().split('=', 2)
     key = key.toLowerCase()
-    if (value) {
+    if (false) {
       value = value.toLowerCase()
     }

[Survived] MethodExpression
next/src/server/image-optimizer.ts:763:15
     let [key, value] = directive.trim().split('=', 2)
     key = key.toLowerCase()
     if (value) {
-      value = value.toLowerCase()
+      value = value.toUpperCase()
     }
     map.set(key, value)

[Killed] BlockStatement
next/src/server/image-optimizer.ts:770:67
   return map
 }
 
-export function getMaxAge(str: string | null | undefined): number {
-  const map = parseCacheControl(str)
-  if (map) {
-    let age = map.get('s-maxage') || map.get('max-age') || ''
-    if (age.startsWith('"') && age.endsWith('"')) {
-      age = age.slice(1, -1)
-    }
-    const n = parseInt(age, 10)
-    if (!isNaN(n)) {
-      return n
-    }
-  }
-  return 0
-}
+export function getMaxAge(str: string | null | undefined): number {}
 export function getPreviouslyCachedImageOrNull(
   upstreamImage: ImageUpstream,
killedBy: getMaxAge should return 0 when no cache-control provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
next/src/server/image-optimizer.ts:772:12
 
 export function getMaxAge(str: string | null | undefined): number {
   const map = parseCacheControl(str)
-  if (map) {
-    let age = map.get('s-maxage') || map.get('max-age') || ''
-    if (age.startsWith('"') && age.endsWith('"')) {
-      age = age.slice(1, -1)
-    }
-    const n = parseInt(age, 10)
-    if (!isNaN(n)) {
-      return n
-    }
-  }
+  if (map) {}
   return 0
 }
killedBy: getMaxAge should return cache-control max-age lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:772:7
 
 export function getMaxAge(str: string | null | undefined): number {
   const map = parseCacheControl(str)
-  if (map) {
+  if (false) {
     let age = map.get('s-maxage') || map.get('max-age') || ''
     if (age.startsWith('"') && age.endsWith('"')) {
killedBy: getMaxAge should return cache-control max-age lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] LogicalOperator
next/src/server/image-optimizer.ts:773:15
 export function getMaxAge(str: string | null | undefined): number {
   const map = parseCacheControl(str)
   if (map) {
-    let age = map.get('s-maxage') || map.get('max-age') || ''
+    let age = (map.get('s-maxage') || map.get('max-age')) && ''
     if (age.startsWith('"') && age.endsWith('"')) {
       age = age.slice(1, -1)
killedBy: getMaxAge should return 0 when no cache-control provided
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:773:15
 export function getMaxAge(str: string | null | undefined): number {
   const map = parseCacheControl(str)
   if (map) {
-    let age = map.get('s-maxage') || map.get('max-age') || ''
+    let age = false
     if (age.startsWith('"') && age.endsWith('"')) {
       age = age.slice(1, -1)
killedBy: getMaxAge should return 0 when no cache-control provided
statusReason: TypeError: age.startsWith is not a function

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:774:9
   const map = parseCacheControl(str)
   if (map) {
     let age = map.get('s-maxage') || map.get('max-age') || ''
-    if (age.startsWith('"') && age.endsWith('"')) {
+    if (false) {
       age = age.slice(1, -1)
     }
killedBy: getMaxAge should return cache-control for a quoted value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:774:9
   const map = parseCacheControl(str)
   if (map) {
     let age = map.get('s-maxage') || map.get('max-age') || ''
-    if (age.startsWith('"') && age.endsWith('"')) {
+    if (true) {
       age = age.slice(1, -1)
     }
killedBy: getMaxAge should return cache-control max-age lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 99

[Killed] MethodExpression
next/src/server/image-optimizer.ts:775:13
   if (map) {
     let age = map.get('s-maxage') || map.get('max-age') || ''
     if (age.startsWith('"') && age.endsWith('"')) {
-      age = age.slice(1, -1)
+      age = age
     }
     const n = parseInt(age, 10)
killedBy: getMaxAge should return cache-control for a quoted value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] UnaryOperator
next/src/server/image-optimizer.ts:775:26
   if (map) {
     let age = map.get('s-maxage') || map.get('max-age') || ''
     if (age.startsWith('"') && age.endsWith('"')) {
-      age = age.slice(1, -1)
+      age = age.slice(1, +1)
     }
     const n = parseInt(age, 10)
killedBy: getMaxAge should return cache-control for a quoted value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:778:9
       age = age.slice(1, -1)
     }
     const n = parseInt(age, 10)
-    if (!isNaN(n)) {
+    if (true) {
       return n
     }
killedBy: getMaxAge should return 0 when no cache-control provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] BlockStatement
next/src/server/image-optimizer.ts:778:20
       age = age.slice(1, -1)
     }
     const n = parseInt(age, 10)
-    if (!isNaN(n)) {
-      return n
-    }
+    if (!isNaN(n)) {}
   }
   return 0
killedBy: getMaxAge should return cache-control max-age lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 0

[Killed] BlockStatement
next/src/server/image-optimizer.ts:787:28
 export function getPreviouslyCachedImageOrNull(
   upstreamImage: ImageUpstream,
   previousCacheEntry: IncrementalCacheEntry | null | undefined
-): CachedImageValue | null {
-  if (
-    previousCacheEntry?.value?.kind === 'IMAGE' &&
-    // Images that are SVGs, animated or failed the optimization previously end up using upstreamEtag as their etag as well,
-    // in these cases we want to trigger a new "optimization" attempt.
-    previousCacheEntry.value.upstreamEtag !== previousCacheEntry.value.etag &&
-    // and the upstream etag is the same as the previous cache entry's
-    upstreamImage.etag === previousCacheEntry.value.upstreamEtag
-  ) {
-    return previousCacheEntry.value
-  }
-  return null
-}
+): CachedImageValue | null {}
 
 export async function optimizeImage({
killedBy: shouldUsePreviouslyCachedEntry should return the cached image if the upstream image matches previous cache entry upstream etag and not the optimized etag
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "Ks3Zv-lS-3GKqzJdAP9Mp2jbu7lgkDOPPrptB0UWbuk"}
Received: undefined

[Killed] OptionalChaining
next/src/server/image-optimizer.ts:789:5
   previousCacheEntry: IncrementalCacheEntry | null | undefined
 ): CachedImageValue | null {
   if (
-    previousCacheEntry?.value?.kind === 'IMAGE' &&
+    previousCacheEntry?.value.kind === 'IMAGE' &&
     // Images that are SVGs, animated or failed the optimization previously end up using upstreamEtag as their etag as well,
     // in these cases we want to trigger a new "optimization" attempt.
killedBy: shouldUsePreviouslyCachedEntry should return null if previous cache entry value is null
statusReason: TypeError: Cannot read properties of null (reading 'kind')

[Killed] LogicalOperator
next/src/server/image-optimizer.ts:789:5
   previousCacheEntry: IncrementalCacheEntry | null | undefined
 ): CachedImageValue | null {
   if (
-    previousCacheEntry?.value?.kind === 'IMAGE' &&
-    // Images that are SVGs, animated or failed the optimization previously end up using upstreamEtag as their etag as well,
-    // in these cases we want to trigger a new "optimization" attempt.
-    previousCacheEntry.value.upstreamEtag !== previousCacheEntry.value.etag &&
-    // and the upstream etag is the same as the previous cache entry's
-    upstreamImage.etag === previousCacheEntry.value.upstreamEtag
+    previousCacheEntry?.value?.kind === 'IMAGE' &&
+// Images that are SVGs, animated or failed the optimization previously end up using upstreamEtag as their etag as well,
+// in these cases we want to trigger a new "optimization" attempt.
+previousCacheEntry.value.upstreamEtag !== previousCacheEntry.value.etag ||
+// and the upstream etag is the same as the previous cache entry's
+upstreamImage.etag === previousCacheEntry.value.upstreamEtag
   ) {
     return previousCacheEntry.value
killedBy: shouldUsePreviouslyCachedEntry should return null if upstream image does not match previous cache entry upstream etag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "Ks3Zv-lS-3GKqzJdAP9Mp2jbu7lgkDOPPrptB0UWbuk"}

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:792:5
     previousCacheEntry?.value?.kind === 'IMAGE' &&
     // Images that are SVGs, animated or failed the optimization previously end up using upstreamEtag as their etag as well,
     // in these cases we want to trigger a new "optimization" attempt.
-    previousCacheEntry.value.upstreamEtag !== previousCacheEntry.value.etag &&
+    // Images that are SVGs, animated or failed the optimization previously end up using upstreamEtag as their etag as well,
+// in these cases we want to trigger a new "optimization" attempt.
+previousCacheEntry.value.upstreamEtag === previousCacheEntry.value.etag &&
     // and the upstream etag is the same as the previous cache entry's
     upstreamImage.etag === previousCacheEntry.value.upstreamEtag
killedBy: shouldUsePreviouslyCachedEntry should return the cached image if the upstream image matches previous cache entry upstream etag and not the optimized etag
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "Ks3Zv-lS-3GKqzJdAP9Mp2jbu7lgkDOPPrptB0UWbuk"}
Received: null

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:792:5
     previousCacheEntry?.value?.kind === 'IMAGE' &&
     // Images that are SVGs, animated or failed the optimization previously end up using upstreamEtag as their etag as well,
     // in these cases we want to trigger a new "optimization" attempt.
-    previousCacheEntry.value.upstreamEtag !== previousCacheEntry.value.etag &&
+    true &&
     // and the upstream etag is the same as the previous cache entry's
     upstreamImage.etag === previousCacheEntry.value.upstreamEtag
killedBy: shouldUsePreviouslyCachedEntry should return null if upstream image matches optimized etag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "Ks3Zv-lS-3GKqzJdAP9Mp2jbu7lgkDOPPrptB0UWbuk", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "Ks3Zv-lS-3GKqzJdAP9Mp2jbu7lgkDOPPrptB0UWbuk"}

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:794:5
     // in these cases we want to trigger a new "optimization" attempt.
     previousCacheEntry.value.upstreamEtag !== previousCacheEntry.value.etag &&
     // and the upstream etag is the same as the previous cache entry's
-    upstreamImage.etag === previousCacheEntry.value.upstreamEtag
+    // and the upstream etag is the same as the previous cache entry's
+upstreamImage.etag !== previousCacheEntry.value.upstreamEtag
   ) {
     return previousCacheEntry.value
killedBy: shouldUsePreviouslyCachedEntry should return the cached image if the upstream image matches previous cache entry upstream etag and not the optimized etag
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "Ks3Zv-lS-3GKqzJdAP9Mp2jbu7lgkDOPPrptB0UWbuk"}
Received: null
