[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:794:5
     // in these cases we want to trigger a new "optimization" attempt.
     previousCacheEntry.value.upstreamEtag !== previousCacheEntry.value.etag &&
     // and the upstream etag is the same as the previous cache entry's
-    upstreamImage.etag === previousCacheEntry.value.upstreamEtag
+    true
   ) {
     return previousCacheEntry.value
killedBy: shouldUsePreviouslyCachedEntry should return null if upstream image does not match previous cache entry upstream etag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "Ks3Zv-lS-3GKqzJdAP9Mp2jbu7lgkDOPPrptB0UWbuk"}

[Killed] BlockStatement
next/src/server/image-optimizer.ts:795:5
     previousCacheEntry.value.upstreamEtag !== previousCacheEntry.value.etag &&
     // and the upstream etag is the same as the previous cache entry's
     upstreamImage.etag === previousCacheEntry.value.upstreamEtag
-  ) {
-    return previousCacheEntry.value
-  }
+  ) {}
   return null
 }
killedBy: shouldUsePreviouslyCachedEntry should return the cached image if the upstream image matches previous cache entry upstream etag and not the optimized etag
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"buffer": {"data": [255, 216, 255, 224, 0, 16, 74, 70, 73, 70, …], "type": "Buffer"}, "etag": "optimized-etag", "extension": "jpeg", "kind": "IMAGE", "upstreamEtag": "Ks3Zv-lS-3GKqzJdAP9Mp2jbu7lgkDOPPrptB0UWbuk"}
Received: null

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:825:21
   const sharp = getSharp(concurrency)
   const transformer = sharp(buffer, {
     limitInputPixels,
-    sequentialRead: sequentialRead ?? undefined,
+    sequentialRead: sequentialRead && undefined,
   })
     .timeout({

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:828:16
     sequentialRead: sequentialRead ?? undefined,
   })
     .timeout({
-      seconds: timeoutInSeconds ?? 7,
+      seconds: timeoutInSeconds && 7,
     })
     .rotate()

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:832:7
     })
     .rotate()
 
-  if (height) {
+  if (false) {
     transformer.resize(width, height)
   } else {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:832:7
     })
     .rotate()
 
-  if (height) {
+  if (true) {
     transformer.resize(width, height)
   } else {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:834:10
 
   if (height) {
     transformer.resize(width, height)
-  } else {
-    transformer.resize(width, undefined, {
-      withoutEnlargement: true,
-    })
-  }
+  } else {}
 
   if (contentType === AVIF) {

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:835:42
   if (height) {
     transformer.resize(width, height)
   } else {
-    transformer.resize(width, undefined, {
-      withoutEnlargement: true,
-    })
+    transformer.resize(width, undefined, {})
   }
 

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:836:27
     transformer.resize(width, height)
   } else {
     transformer.resize(width, undefined, {
-      withoutEnlargement: true,
+      withoutEnlargement: false,
     })
   }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:840:7
     })
   }
 
-  if (contentType === AVIF) {
+  if (true) {
     transformer.avif({
       quality: Math.max(quality - 20, 1),

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:840:29
     })
   }
 
-  if (contentType === AVIF) {
-    transformer.avif({
-      quality: Math.max(quality - 20, 1),
-      effort: 3,
-    })
-  } else if (contentType === WEBP) {
+  if (contentType === AVIF) {} else if (contentType === WEBP) {
     transformer.webp({ quality })
   } else if (contentType === PNG) {

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:841:22
   }
 
   if (contentType === AVIF) {
-    transformer.avif({
-      quality: Math.max(quality - 20, 1),
-      effort: 3,
-    })
+    transformer.avif({})
   } else if (contentType === WEBP) {
     transformer.webp({ quality })

[NoCoverage] ArithmeticOperator
next/src/server/image-optimizer.ts:842:25
 
   if (contentType === AVIF) {
     transformer.avif({
-      quality: Math.max(quality - 20, 1),
+      quality: Math.max(quality + 20, 1),
       effort: 3,
     })

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:842:16
 
   if (contentType === AVIF) {
     transformer.avif({
-      quality: Math.max(quality - 20, 1),
+      quality: Math.min(quality - 20, 1),
       effort: 3,
     })

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:845:14
       quality: Math.max(quality - 20, 1),
       effort: 3,
     })
-  } else if (contentType === WEBP) {
+  } else if (false) {
     transformer.webp({ quality })
   } else if (contentType === PNG) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:845:14
       quality: Math.max(quality - 20, 1),
       effort: 3,
     })
-  } else if (contentType === WEBP) {
+  } else if (true) {
     transformer.webp({ quality })
   } else if (contentType === PNG) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:847:14
     })
   } else if (contentType === WEBP) {
     transformer.webp({ quality })
-  } else if (contentType === PNG) {
+  } else if (true) {
     transformer.png({ quality })
   } else if (contentType === JPEG) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:847:14
     })
   } else if (contentType === WEBP) {
     transformer.webp({ quality })
-  } else if (contentType === PNG) {
+  } else if (false) {
     transformer.png({ quality })
   } else if (contentType === JPEG) {

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:849:14
     transformer.webp({ quality })
   } else if (contentType === PNG) {
     transformer.png({ quality })
-  } else if (contentType === JPEG) {
+  } else if (contentType !== JPEG) {
     transformer.jpeg({ quality, mozjpeg: true })
   }

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:849:14
     transformer.webp({ quality })
   } else if (contentType === PNG) {
     transformer.png({ quality })
-  } else if (contentType === JPEG) {
+  } else if (true) {
     transformer.jpeg({ quality, mozjpeg: true })
   }

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:850:42
   } else if (contentType === PNG) {
     transformer.png({ quality })
   } else if (contentType === JPEG) {
-    transformer.jpeg({ quality, mozjpeg: true })
+    transformer.jpeg({ quality, mozjpeg: false })
   }
 

[Survived] BlockStatement
next/src/server/image-optimizer.ts:858:41
   return optimizedBuffer
 }
 
-function isRedirect(statusCode: number) {
-  return [301, 302, 303, 307, 308].includes(statusCode)
-}
+function isRedirect(statusCode: number) {}
 
 export async function fetchExternalImage(

[Survived] ArrayDeclaration
next/src/server/image-optimizer.ts:859:10
 }
 
 function isRedirect(statusCode: number) {
-  return [301, 302, 303, 307, 308].includes(statusCode)
+  return [].includes(statusCode)
 }
 

[Survived] BooleanLiteral
next/src/server/image-optimizer.ts:868:7
   maximumResponseBody: number,
   count = 3
 ): Promise<ImageUpstream> {
-  if (!dangerouslyAllowLocalIP) {
+  if (dangerouslyAllowLocalIP) {
     const { hostname } = new URL(href)
     let ips = [hostname]

[Survived] ConditionalExpression
next/src/server/image-optimizer.ts:868:7
   maximumResponseBody: number,
   count = 3
 ): Promise<ImageUpstream> {
-  if (!dangerouslyAllowLocalIP) {
+  if (true) {
     const { hostname } = new URL(href)
     let ips = [hostname]

[Survived] ConditionalExpression
next/src/server/image-optimizer.ts:871:9
   if (!dangerouslyAllowLocalIP) {
     const { hostname } = new URL(href)
     let ips = [hostname]
-    if (!isIP(hostname)) {
+    if (true) {
       const records = await lookup(hostname, {
         family: 0,

[Survived] BooleanLiteral
next/src/server/image-optimizer.ts:871:9
   if (!dangerouslyAllowLocalIP) {
     const { hostname } = new URL(href)
     let ips = [hostname]
-    if (!isIP(hostname)) {
+    if (isIP(hostname)) {
       const records = await lookup(hostname, {
         family: 0,

[Killed] BooleanLiteral
next/src/server/image-optimizer.ts:874:14
     if (!isIP(hostname)) {
       const records = await lookup(hostname, {
         family: 0,
-        all: true,
+        all: false,
         hints: ALL,
       }).catch((_) => [{ address: hostname }])
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ImageError
Received constructor: TypeError

[Survived] ArrowFunction
next/src/server/image-optimizer.ts:876:16
         family: 0,
         all: true,
         hints: ALL,
-      }).catch((_) => [{ address: hostname }])
+      }).catch(() => undefined)
       ips = records.map((record) => record.address)
     }

[Killed] ArrowFunction
next/src/server/image-optimizer.ts:877:25
         all: true,
         hints: ALL,
       }).catch((_) => [{ address: hostname }])
-      ips = records.map((record) => record.address)
+      ips = records.map(() => undefined)
     }
     const privateIps = ips.filter((ip) => isPrivateIp(ip))
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ImageError
Received constructor: TypeError

[Killed] MethodExpression
next/src/server/image-optimizer.ts:879:24
       }).catch((_) => [{ address: hostname }])
       ips = records.map((record) => record.address)
     }
-    const privateIps = ips.filter((ip) => isPrivateIp(ip))
+    const privateIps = ips
     if (privateIps.length > 0) {
       Log.error(
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\"url\" parameter is valid but upstream response is invalid"
Received: "\"url\" parameter is not allowed"

[Survived] ArrowFunction
next/src/server/image-optimizer.ts:879:35
       }).catch((_) => [{ address: hostname }])
       ips = records.map((record) => record.address)
     }
-    const privateIps = ips.filter((ip) => isPrivateIp(ip))
+    const privateIps = ips.filter(() => undefined)
     if (privateIps.length > 0) {
       Log.error(

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:880:9
       ips = records.map((record) => record.address)
     }
     const privateIps = ips.filter((ip) => isPrivateIp(ip))
-    if (privateIps.length > 0) {
+    if (privateIps.length >= 0) {
       Log.error(
         'upstream image',
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\"url\" parameter is valid but upstream response is invalid"
Received: "\"url\" parameter is not allowed"

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:880:9
       ips = records.map((record) => record.address)
     }
     const privateIps = ips.filter((ip) => isPrivateIp(ip))
-    if (privateIps.length > 0) {
+    if (privateIps.length <= 0) {
       Log.error(
         'upstream image',
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\"url\" parameter is valid but upstream response is invalid"
Received: "\"url\" parameter is not allowed"

[Survived] ArrowFunction
next/src/server/image-optimizer.ts:893:12
   const res = await fetch(href, {
     signal: AbortSignal.timeout(7_000),
     redirect: 'manual',
-  }).catch((err) => err as Error)
+  }).catch(() => undefined)
 
   if (res instanceof Error) {

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:895:7
     redirect: 'manual',
   }).catch((err) => err as Error)
 
-  if (res instanceof Error) {
+  if (true) {
     const err = res as Error
     if (err.name === 'TimeoutError') {
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ImageError
Received constructor: Object

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:895:29
     redirect: 'manual',
   }).catch((err) => err as Error)
 
-  if (res instanceof Error) {
-    const err = res as Error
-    if (err.name === 'TimeoutError') {
-      Log.error('upstream image response timed out for', href)
-      throw new ImageError(
-        504,
-        '"url" parameter is valid but upstream response timed out'
-      )
-    }
-    throw err
-  }
+  if (res instanceof Error) {}
 
   const locationHeader = res.headers.get('Location')

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:897:9
 
   if (res instanceof Error) {
     const err = res as Error
-    if (err.name === 'TimeoutError') {
+    if (err.name !== 'TimeoutError') {
       Log.error('upstream image response timed out for', href)
       throw new ImageError(

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:897:9
 
   if (res instanceof Error) {
     const err = res as Error
-    if (err.name === 'TimeoutError') {
+    if (false) {
       Log.error('upstream image response timed out for', href)
       throw new ImageError(

[Killed] LogicalOperator
next/src/server/image-optimizer.ts:909:5
 
   const locationHeader = res.headers.get('Location')
   if (
-    isRedirect(res.status) &&
-    locationHeader &&
-    URL.canParse(locationHeader, href)
+    isRedirect(res.status) && locationHeader || URL.canParse(locationHeader, href)
   ) {
     if (count === 0) {
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 508

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:909:5
 
   const locationHeader = res.headers.get('Location')
   if (
-    isRedirect(res.status) &&
-    locationHeader &&
-    URL.canParse(locationHeader, href)
+    true
   ) {
     if (count === 0) {
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 508

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:912:5
     isRedirect(res.status) &&
     locationHeader &&
     URL.canParse(locationHeader, href)
-  ) {
-    if (count === 0) {
-      Log.error('upstream image response had too many redirects', href)
-      throw new ImageError(
-        508,
-        '"url" parameter is valid but upstream response is invalid'
-      )
-    }
-    const redirect = new URL(locationHeader, href).href
-    return fetchExternalImage(
-      redirect,
-      dangerouslyAllowLocalIP,
-      maximumResponseBody,
-      count - 1
-    )
-  }
+  ) {}
 
   if (!res.ok) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:913:9
     locationHeader &&
     URL.canParse(locationHeader, href)
   ) {
-    if (count === 0) {
+    if (false) {
       Log.error('upstream image response had too many redirects', href)
       throw new ImageError(

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:913:22
     locationHeader &&
     URL.canParse(locationHeader, href)
   ) {
-    if (count === 0) {
-      Log.error('upstream image response had too many redirects', href)
-      throw new ImageError(
-        508,
-        '"url" parameter is valid but upstream response is invalid'
-      )
-    }
+    if (count === 0) {}
     const redirect = new URL(locationHeader, href).href
     return fetchExternalImage(

[NoCoverage] ArithmeticOperator
next/src/server/image-optimizer.ts:925:7
       redirect,
       dangerouslyAllowLocalIP,
       maximumResponseBody,
-      count - 1
+      count + 1
     )
   }

[Killed] ConditionalExpression
next/src/server/image-optimizer.ts:937:7
     )
   }
 
-  if (!res.body) {
+  if (true) {
     Log.error('upstream image response is empty for', href)
     throw new ImageError(
killedBy: fetchExternalImage response size limit should throw error when exceeding maximumResponseBody config on later chunk
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 413
Received: 400

[Killed] BooleanLiteral
next/src/server/image-optimizer.ts:937:7
     )
   }
 
-  if (!res.body) {
+  if (res.body) {
     Log.error('upstream image response is empty for', href)
     throw new ImageError(
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ImageError
Received constructor: TypeError

[Survived] StringLiteral
next/src/server/image-optimizer.ts:938:15
   }
 
   if (!res.body) {
-    Log.error('upstream image response is empty for', href)
+    Log.error("", href)
     throw new ImageError(
       400,

[Killed] StringLiteral
next/src/server/image-optimizer.ts:941:7
     Log.error('upstream image response is empty for', href)
     throw new ImageError(
       400,
-      '"url" parameter is valid but upstream response is invalid'
+      ""
     )
   }
killedBy: fetchExternalImage response size limit should throw error when response has no body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\"url\" parameter is valid but upstream response is invalid"
Received: ""

[Killed] ArrayDeclaration
next/src/server/image-optimizer.ts:945:28
     )
   }
 
-  const chunks: Buffer[] = []
+  const chunks: Buffer[] = ["Stryker was here"]
   let totalSize = 0
 
killedBy: fetchExternalImage response size limit should succeed when exactly matching maximumResponseBody config on first chunk
statusReason: TypeError: The "list[0]" argument must be an instance of Buffer or Uint8Array. Received type string ('Stryker was here')

[Killed] BlockStatement
next/src/server/image-optimizer.ts:948:35
   const chunks: Buffer[] = []
   let totalSize = 0
 
-  for await (const c of res.body) {
-    const chunk = Buffer.from(c)
-    totalSize += chunk.byteLength
-    if (totalSize > maximumResponseBody) {
-      Log.error(
-        'upstream image response exceeded maximum size for',
-        href,
-        totalSize
-      )
-      throw new ImageError(
-        413,
-        '"url" parameter is valid but upstream response is invalid'
-      )
-    }
-    chunks.push(chunk)
-  }
+  for await (const c of res.body) {}
 
   const buffer = Buffer.concat(chunks)
killedBy: fetchExternalImage response size limit should throw error when exceeding maximumResponseBody config on later chunk
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ImageError
Received constructor: Object

[Killed] AssignmentOperator
next/src/server/image-optimizer.ts:950:5
 
   for await (const c of res.body) {
     const chunk = Buffer.from(c)
-    totalSize += chunk.byteLength
+    totalSize -= chunk.byteLength
     if (totalSize > maximumResponseBody) {
       Log.error(
killedBy: fetchExternalImage response size limit should throw error when exceeding maximumResponseBody config on later chunk
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ImageError
Received constructor: Object

[Killed] EqualityOperator
next/src/server/image-optimizer.ts:951:9
   for await (const c of res.body) {
     const chunk = Buffer.from(c)
     totalSize += chunk.byteLength
-    if (totalSize > maximumResponseBody) {
+    if (totalSize >= maximumResponseBody) {
       Log.error(
         'upstream image response exceeded maximum size for',
killedBy: fetchExternalImage response size limit should succeed when exactly matching maximumResponseBody config on first chunk
statusReason: Error: "url" parameter is valid but upstream response is invalid

[Killed] BlockStatement
next/src/server/image-optimizer.ts:951:42
   for await (const c of res.body) {
     const chunk = Buffer.from(c)
     totalSize += chunk.byteLength
-    if (totalSize > maximumResponseBody) {
-      Log.error(
-        'upstream image response exceeded maximum size for',
-        href,
-        totalSize
-      )
-      throw new ImageError(
-        413,
-        '"url" parameter is valid but upstream response is invalid'
-      )
-    }
+    if (totalSize > maximumResponseBody) {}
     chunks.push(chunk)
   }
killedBy: fetchExternalImage response size limit should throw error when exceeding maximumResponseBody config on later chunk
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ImageError
Received constructor: Object

[Survived] StringLiteral
next/src/server/image-optimizer.ts:953:9
     totalSize += chunk.byteLength
     if (totalSize > maximumResponseBody) {
       Log.error(
-        'upstream image response exceeded maximum size for',
+        "",
         href,
         totalSize

[Survived] StringLiteral
next/src/server/image-optimizer.ts:966:39
   }
 
   const buffer = Buffer.concat(chunks)
-  const contentType = res.headers.get('Content-Type')
+  const contentType = res.headers.get("")
   const cacheControl = res.headers.get('Cache-Control')
   const etag = extractEtag(res.headers.get('ETag'), buffer)

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:984:20
 ): Promise<ImageUpstream> {
   try {
     // Coerce HEAD to GET to avoid issues with the image optimizer
-    const method = !_req.method || _req.method === 'HEAD' ? 'GET' : _req.method
+    const method = _req.method || _req.method === 'HEAD' ? 'GET' : _req.method
 
     const mocked = createRequestResponseMocks({

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:984:20
 ): Promise<ImageUpstream> {
   try {
     // Coerce HEAD to GET to avoid issues with the image optimizer
-    const method = !_req.method || _req.method === 'HEAD' ? 'GET' : _req.method
+    const method = false ? 'GET' : _req.method
 
     const mocked = createRequestResponseMocks({

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:992:69
       socket: _req.socket,
     })
 
-    await handleRequest(mocked.req, mocked.res, nodeUrl.parse(href, true))
+    await handleRequest(mocked.req, mocked.res, nodeUrl.parse(href, false))
     await mocked.res.hasStreamed
 

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:995:9
     await handleRequest(mocked.req, mocked.res, nodeUrl.parse(href, true))
     await mocked.res.hasStreamed
 
-    if (!mocked.res.statusCode) {
+    if (true) {
       Log.error('image response failed for', href, mocked.res.statusCode)
       throw new ImageError(

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:995:9
     await handleRequest(mocked.req, mocked.res, nodeUrl.parse(href, true))
     await mocked.res.hasStreamed
 
-    if (!mocked.res.statusCode) {
+    if (mocked.res.statusCode) {
       Log.error('image response failed for', href, mocked.res.statusCode)
       throw new ImageError(

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1004:46
     }
 
     const buffer = Buffer.concat(mocked.res.buffers)
-    const contentType = mocked.res.getHeader('Content-Type')
+    const contentType = mocked.res.getHeader("")
     const cacheControl = mocked.res.getHeader('Cache-Control')
     const etag = extractEtag(mocked.res.getHeader('ETag'), buffer)

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1005:47
 
     const buffer = Buffer.concat(mocked.res.buffers)
     const contentType = mocked.res.getHeader('Content-Type')
-    const cacheControl = mocked.res.getHeader('Cache-Control')
+    const cacheControl = mocked.res.getHeader("")
     const etag = extractEtag(mocked.res.getHeader('ETag'), buffer)
 

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1006:51
     const buffer = Buffer.concat(mocked.res.buffers)
     const contentType = mocked.res.getHeader('Content-Type')
     const cacheControl = mocked.res.getHeader('Cache-Control')
-    const etag = extractEtag(mocked.res.getHeader('ETag'), buffer)
+    const etag = extractEtag(mocked.res.getHeader(""), buffer)
 
     return { buffer, contentType, cacheControl, etag }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1009:17
     const etag = extractEtag(mocked.res.getHeader('ETag'), buffer)
 
     return { buffer, contentType, cacheControl, etag }
-  } catch (err) {
-    Log.error('upstream image response failed for', href, err)
-    throw new ImageError(
-      500,
-      '"url" parameter is valid but upstream response is invalid'
-    )
-  }
+  } catch (err) {}
 }
 

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1010:15
 
     return { buffer, contentType, cacheControl, etag }
   } catch (err) {
-    Log.error('upstream image response failed for', href, err)
+    Log.error("", href, err)
     throw new ImageError(
       500,

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:1053:18
 }> {
   const { href, quality, width, mimeType } = paramsResult
   const { buffer: upstreamBuffer, etag: upstreamEtag } = imageUpstream
-  const maxAge = Math.max(
-    nextConfig.images.minimumCacheTTL,
-    getMaxAge(imageUpstream.cacheControl)
-  )
+  const maxAge = Math.min(nextConfig.images.minimumCacheTTL, getMaxAge(imageUpstream.cacheControl))
 
   const upstreamType = await detectContentType(

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:1065:5
   )
 
   if (
-    !upstreamType ||
+    upstreamType ||
     !upstreamType.startsWith('image/') ||
     upstreamType.includes(',')

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1065:5
   )
 
   if (
-    !upstreamType ||
-    !upstreamType.startsWith('image/') ||
-    upstreamType.includes(',')
+    false
   ) {
     if (!opts.silent) {

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:1066:6
 
   if (
     !upstreamType ||
-    !upstreamType.startsWith('image/') ||
+    !upstreamType.endsWith('image/') ||
     upstreamType.includes(',')
   ) {

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:1066:5
 
   if (
     !upstreamType ||
-    !upstreamType.startsWith('image/') ||
+    upstreamType.startsWith('image/') ||
     upstreamType.includes(',')
   ) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1068:5
     !upstreamType ||
     !upstreamType.startsWith('image/') ||
     upstreamType.includes(',')
-  ) {
-    if (!opts.silent) {
-      Log.error(
-        "The requested resource isn't a valid image for",
-        href,
-        'received',
-        upstreamType
-      )
-    }
-    throw new ImageError(400, "The requested resource isn't a valid image.")
-  }
+  ) {}
   if (
     upstreamType.startsWith('image/svg') &&

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1069:9
     !upstreamType.startsWith('image/') ||
     upstreamType.includes(',')
   ) {
-    if (!opts.silent) {
+    if (false) {
       Log.error(
         "The requested resource isn't a valid image for",

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1069:23
     !upstreamType.startsWith('image/') ||
     upstreamType.includes(',')
   ) {
-    if (!opts.silent) {
-      Log.error(
-        "The requested resource isn't a valid image for",
-        href,
-        'received',
-        upstreamType
-      )
-    }
+    if (!opts.silent) {}
     throw new ImageError(400, "The requested resource isn't a valid image.")
   }

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1071:9
   ) {
     if (!opts.silent) {
       Log.error(
-        "The requested resource isn't a valid image for",
+        "",
         href,
         'received',

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1073:9
       Log.error(
         "The requested resource isn't a valid image for",
         href,
-        'received',
+        "",
         upstreamType
       )

[NoCoverage] MethodExpression
next/src/server/image-optimizer.ts:1080:5
     throw new ImageError(400, "The requested resource isn't a valid image.")
   }
   if (
-    upstreamType.startsWith('image/svg') &&
+    upstreamType.endsWith('image/svg') &&
     !nextConfig.images.dangerouslyAllowSVG
   ) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1080:5
     throw new ImageError(400, "The requested resource isn't a valid image.")
   }
   if (
-    upstreamType.startsWith('image/svg') &&
-    !nextConfig.images.dangerouslyAllowSVG
+    true
   ) {
     if (!opts.silent) {

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:1081:5
   }
   if (
     upstreamType.startsWith('image/svg') &&
-    !nextConfig.images.dangerouslyAllowSVG
+    nextConfig.images.dangerouslyAllowSVG
   ) {
     if (!opts.silent) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1082:5
   if (
     upstreamType.startsWith('image/svg') &&
     !nextConfig.images.dangerouslyAllowSVG
-  ) {
-    if (!opts.silent) {
-      Log.error(
-        `The requested resource "${href}" has type "${upstreamType}" but dangerouslyAllowSVG is disabled. Consider adding the "unoptimized" property to the <Image>.`
-      )
-    }
-    throw new ImageError(
-      400,
-      '"url" parameter is valid but image type is not allowed'
-    )
-  }
+  ) {}
   if (ANIMATABLE_TYPES.includes(upstreamType) && isAnimated(upstreamBuffer)) {
     if (!opts.silent) {
