[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1083:23
     upstreamType.startsWith('image/svg') &&
     !nextConfig.images.dangerouslyAllowSVG
   ) {
-    if (!opts.silent) {
-      Log.error(
-        `The requested resource "${href}" has type "${upstreamType}" but dangerouslyAllowSVG is disabled. Consider adding the "unoptimized" property to the <Image>.`
-      )
-    }
+    if (!opts.silent) {}
     throw new ImageError(
       400,

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:1083:9
     upstreamType.startsWith('image/svg') &&
     !nextConfig.images.dangerouslyAllowSVG
   ) {
-    if (!opts.silent) {
+    if (opts.silent) {
       Log.error(
         `The requested resource "${href}" has type "${upstreamType}" but dangerouslyAllowSVG is disabled. Consider adding the "unoptimized" property to the <Image>.`

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:1093:7
       '"url" parameter is valid but image type is not allowed'
     )
   }
-  if (ANIMATABLE_TYPES.includes(upstreamType) && isAnimated(upstreamBuffer)) {
+  if (ANIMATABLE_TYPES.includes(upstreamType) || isAnimated(upstreamBuffer)) {
     if (!opts.silent) {
       Log.warnOnce(

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1093:7
       '"url" parameter is valid but image type is not allowed'
     )
   }
-  if (ANIMATABLE_TYPES.includes(upstreamType) && isAnimated(upstreamBuffer)) {
+  if (true) {
     if (!opts.silent) {
       Log.warnOnce(

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1094:9
     )
   }
   if (ANIMATABLE_TYPES.includes(upstreamType) && isAnimated(upstreamBuffer)) {
-    if (!opts.silent) {
+    if (true) {
       Log.warnOnce(
         `The requested resource "${href}" is an animated image so it will not be optimized. Consider adding the "unoptimized" property to the <Image>.`

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:1094:9
     )
   }
   if (ANIMATABLE_TYPES.includes(upstreamType) && isAnimated(upstreamBuffer)) {
-    if (!opts.silent) {
+    if (opts.silent) {
       Log.warnOnce(
         `The requested resource "${href}" is an animated image so it will not be optimized. Consider adding the "unoptimized" property to the <Image>.`

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:1099:12
         `The requested resource "${href}" is an animated image so it will not be optimized. Consider adding the "unoptimized" property to the <Image>.`
       )
     }
-    return {
-      buffer: upstreamBuffer,
-      contentType: upstreamType,
-      maxAge,
-      etag: upstreamEtag,
-      upstreamEtag,
-    }
+    return {}
   }
   if (BYPASS_TYPES.includes(upstreamType)) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1107:7
       upstreamEtag,
     }
   }
-  if (BYPASS_TYPES.includes(upstreamType)) {
+  if (true) {
     return {
       buffer: upstreamBuffer,

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1107:7
       upstreamEtag,
     }
   }
-  if (BYPASS_TYPES.includes(upstreamType)) {
+  if (false) {
     return {
       buffer: upstreamBuffer,

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:1108:12
     }
   }
   if (BYPASS_TYPES.includes(upstreamType)) {
-    return {
-      buffer: upstreamBuffer,
-      contentType: upstreamType,
-      maxAge,
-      etag: upstreamEtag,
-      upstreamEtag,
-    }
+    return {}
   }
 

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1119:7
 
   let contentType: string
 
-  if (mimeType) {
+  if (true) {
     contentType = mimeType
   } else if (

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1119:7
 
   let contentType: string
 
-  if (mimeType) {
+  if (false) {
     contentType = mimeType
   } else if (

[NoCoverage] LogicalOperator
next/src/server/image-optimizer.ts:1122:5
   if (mimeType) {
     contentType = mimeType
   } else if (
-    getExtension(upstreamType) &&
-    upstreamType !== WEBP &&
-    upstreamType !== AVIF
+    getExtension(upstreamType) && upstreamType !== WEBP || upstreamType !== AVIF
   ) {
     contentType = upstreamType

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1122:5
   if (mimeType) {
     contentType = mimeType
   } else if (
-    getExtension(upstreamType) &&
-    upstreamType !== WEBP &&
-    upstreamType !== AVIF
+    false
   ) {
     contentType = upstreamType

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:1123:5
     contentType = mimeType
   } else if (
     getExtension(upstreamType) &&
-    upstreamType !== WEBP &&
+    upstreamType === WEBP &&
     upstreamType !== AVIF
   ) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1123:5
     contentType = mimeType
   } else if (
     getExtension(upstreamType) &&
-    upstreamType !== WEBP &&
+    true &&
     upstreamType !== AVIF
   ) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1124:5
   } else if (
     getExtension(upstreamType) &&
     upstreamType !== WEBP &&
-    upstreamType !== AVIF
+    true
   ) {
     contentType = upstreamType

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:1124:5
   } else if (
     getExtension(upstreamType) &&
     upstreamType !== WEBP &&
-    upstreamType !== AVIF
+    upstreamType === AVIF
   ) {
     contentType = upstreamType

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1125:5
     getExtension(upstreamType) &&
     upstreamType !== WEBP &&
     upstreamType !== AVIF
-  ) {
-    contentType = upstreamType
-  } else {
+  ) {} else {
     contentType = JPEG
   }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1127:10
     upstreamType !== AVIF
   ) {
     contentType = upstreamType
-  } else {
-    contentType = JPEG
-  }
+  } else {}
   const previouslyCachedImage = getPreviouslyCachedImageOrNull(
     imageUpstream,

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1134:7
     imageUpstream,
     opts.previousCacheEntry
   )
-  if (previouslyCachedImage) {
+  if (false) {
     return {
       buffer: previouslyCachedImage.buffer,

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1134:7
     imageUpstream,
     opts.previousCacheEntry
   )
-  if (previouslyCachedImage) {
+  if (true) {
     return {
       buffer: previouslyCachedImage.buffer,

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:1138:15
     return {
       buffer: previouslyCachedImage.buffer,
       contentType,
-      maxAge: opts?.previousCacheEntry?.cacheControl?.revalidate || maxAge,
+      maxAge: opts.previousCacheEntry?.cacheControl?.revalidate || maxAge,
       etag: previouslyCachedImage.etag,
       upstreamEtag: previouslyCachedImage.upstreamEtag,

[NoCoverage] OptionalChaining
next/src/server/image-optimizer.ts:1138:15
     return {
       buffer: previouslyCachedImage.buffer,
       contentType,
-      maxAge: opts?.previousCacheEntry?.cacheControl?.revalidate || maxAge,
+      maxAge: opts?.previousCacheEntry.cacheControl?.revalidate || maxAge,
       etag: previouslyCachedImage.etag,
       upstreamEtag: previouslyCachedImage.upstreamEtag,

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:1155:49
       sequentialRead: nextConfig.experimental.imgOptSequentialRead,
       timeoutInSeconds: nextConfig.experimental.imgOptTimeoutInSeconds,
     })
-    if (opts.isDev && width <= BLUR_IMG_SIZE && quality === BLUR_QUALITY) {
+    if (opts.isDev && width <= BLUR_IMG_SIZE && quality !== BLUR_QUALITY) {
       // During `next dev`, we don't want to generate blur placeholders with webpack
       // because it can delay starting the dev server. Instead, `next-image-loader.js`

[NoCoverage] EqualityOperator
next/src/server/image-optimizer.ts:1155:23
       sequentialRead: nextConfig.experimental.imgOptSequentialRead,
       timeoutInSeconds: nextConfig.experimental.imgOptTimeoutInSeconds,
     })
-    if (opts.isDev && width <= BLUR_IMG_SIZE && quality === BLUR_QUALITY) {
+    if (opts.isDev && width < BLUR_IMG_SIZE && quality === BLUR_QUALITY) {
       // During `next dev`, we don't want to generate blur placeholders with webpack
       // because it can delay starting the dev server. Instead, `next-image-loader.js`

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:1160:24
       // because it can delay starting the dev server. Instead, `next-image-loader.js`
       // will inline a special url to lazily generate the blur placeholder at request time.
       const meta = await getImageSize(optimizedBuffer)
-      const blurOpts = {
-        blurWidth: meta.width,
-        blurHeight: meta.height,
-        blurDataURL: `data:${contentType};base64,${optimizedBuffer.toString(
-          'base64'
-        )}`,
-      }
+      const blurOpts = {}
       optimizedBuffer = Buffer.from(unescape(getImageBlurSvg(blurOpts)))
       contentType = 'image/svg+xml'

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1164:11
         blurWidth: meta.width,
         blurHeight: meta.height,
         blurDataURL: `data:${contentType};base64,${optimizedBuffer.toString(
-          'base64'
+          ""
         )}`,
       }

[NoCoverage] ObjectLiteral
next/src/server/image-optimizer.ts:1170:12
       optimizedBuffer = Buffer.from(unescape(getImageBlurSvg(blurOpts)))
       contentType = 'image/svg+xml'
     }
-    return {
-      buffer: optimizedBuffer,
-      contentType,
-      maxAge,
-      etag: getImageEtag(optimizedBuffer),
-      upstreamEtag,
-    }
+    return {}
   } catch (error) {
     if (upstreamType) {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1177:19
       etag: getImageEtag(optimizedBuffer),
       upstreamEtag,
     }
-  } catch (error) {
-    if (upstreamType) {
-      // If we fail to optimize, fallback to the original image
-      return {
-        buffer: upstreamBuffer,
-        contentType: upstreamType,
-        maxAge: nextConfig.images.minimumCacheTTL,
-        etag: upstreamEtag,
-        upstreamEtag,
-        error,
-      }
-    } else {
-      throw new ImageError(
-        400,
-        'Unable to optimize image and unable to fallback to upstream image'
-      )
-    }
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1178:23
       upstreamEtag,
     }
   } catch (error) {
-    if (upstreamType) {
-      // If we fail to optimize, fallback to the original image
-      return {
-        buffer: upstreamBuffer,
-        contentType: upstreamType,
-        maxAge: nextConfig.images.minimumCacheTTL,
-        etag: upstreamEtag,
-        upstreamEtag,
-        error,
-      }
-    } else {
+    if (upstreamType) {} else {
       throw new ImageError(
         400,

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1178:9
       upstreamEtag,
     }
   } catch (error) {
-    if (upstreamType) {
+    if (true) {
       // If we fail to optimize, fallback to the original image
       return {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1188:12
         upstreamEtag,
         error,
       }
-    } else {
-      throw new ImageError(
-        400,
-        'Unable to optimize image and unable to fallback to upstream image'
-      )
-    }
+    } else {}
   }
 }

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1191:9
     } else {
       throw new ImageError(
         400,
-        'Unable to optimize image and unable to fallback to upstream image'
+        ""
       )
     }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1200:11
 function getFileNameWithExtension(
   url: string,
   contentType: string | null
-): string {
-  const [urlWithoutQueryParams] = url.split('?', 1)
-  const fileNameWithExtension = urlWithoutQueryParams.split('/').pop()
-  if (!contentType || !fileNameWithExtension) {
-    return 'image.bin'
-  }
-
-  const [fileName] = fileNameWithExtension.split('.', 1)
-  const extension = getExtension(contentType)
-  return `${fileName}.${extension}`
-}
+): string {}
 
 function setResponseHeaders(

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1203:47
 ): string {
   const [urlWithoutQueryParams] = url.split('?', 1)
   const fileNameWithExtension = urlWithoutQueryParams.split('/').pop()
-  if (!contentType || !fileNameWithExtension) {
-    return 'image.bin'
-  }
+  if (!contentType || !fileNameWithExtension) {}
 
   const [fileName] = fileNameWithExtension.split('.', 1)

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1203:7
 ): string {
   const [urlWithoutQueryParams] = url.split('?', 1)
   const fileNameWithExtension = urlWithoutQueryParams.split('/').pop()
-  if (!contentType || !fileNameWithExtension) {
+  if (true) {
     return 'image.bin'
   }

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1209:10
 
   const [fileName] = fileNameWithExtension.split('.', 1)
   const extension = getExtension(contentType)
-  return `${fileName}.${extension}`
+  return ``
 }
 

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1224:17
   maxAge: number,
   isDev: boolean
 ) {
-  res.setHeader('Vary', 'Accept')
+  res.setHeader("", 'Accept')
   res.setHeader(
     'Cache-Control',

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1231:41
       ? 'public, max-age=315360000, immutable'
       : `public, max-age=${isDev ? 0 : maxAge}, must-revalidate`
   )
-  if (sendEtagResponse(req, res, etag)) {
-    // already called res.end() so we're finished
-    return { finished: true }
-  }
+  if (sendEtagResponse(req, res, etag)) {}
   if (contentType) {
     res.setHeader('Content-Type', contentType)

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1231:7
       ? 'public, max-age=315360000, immutable'
       : `public, max-age=${isDev ? 0 : maxAge}, must-revalidate`
   )
-  if (sendEtagResponse(req, res, etag)) {
+  if (false) {
     // already called res.end() so we're finished
     return { finished: true }

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:1233:24
   )
   if (sendEtagResponse(req, res, etag)) {
     // already called res.end() so we're finished
-    return { finished: true }
+    return { finished: false }
   }
   if (contentType) {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1235:7
     // already called res.end() so we're finished
     return { finished: true }
   }
-  if (contentType) {
+  if (true) {
     res.setHeader('Content-Type', contentType)
   }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1235:20
     // already called res.end() so we're finished
     return { finished: true }
   }
-  if (contentType) {
-    res.setHeader('Content-Type', contentType)
-  }
+  if (contentType) {}
 
   const fileName = getFileNameWithExtension(url, contentType)

[NoCoverage] BooleanLiteral
next/src/server/image-optimizer.ts:1248:22
   res.setHeader('Content-Security-Policy', imagesConfig.contentSecurityPolicy)
   res.setHeader('X-Nextjs-Cache', xCache)
 
-  return { finished: false }
+  return { finished: true }
 }
 

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1263:3
   imagesConfig: ImageConfigComplete,
   maxAge: number,
   isDev: boolean
-) {
-  const contentType = getContentType(extension)
-  const result = setResponseHeaders(
-    req,
-    res,
-    url,
-    etag,
-    contentType,
-    isStatic,
-    xCache,
-    imagesConfig,
-    maxAge,
-    isDev
-  )
-  if (!result.finished) {
-    res.setHeader('Content-Length', Buffer.byteLength(buffer))
-    // A response body must not be sent for HEAD requests
-    if (req.method === 'HEAD') {
-      res.end()
-    } else {
-      res.end(buffer)
-    }
-  }
-}
+) {}
 
 export async function getImageSize(buffer: Buffer): Promise<{

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1277:7
     maxAge,
     isDev
   )
-  if (!result.finished) {
+  if (false) {
     res.setHeader('Content-Length', Buffer.byteLength(buffer))
     // A response body must not be sent for HEAD requests

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1277:25
     maxAge,
     isDev
   )
-  if (!result.finished) {
-    res.setHeader('Content-Length', Buffer.byteLength(buffer))
-    // A response body must not be sent for HEAD requests
-    if (req.method === 'HEAD') {
-      res.end()
-    } else {
-      res.end(buffer)
-    }
-  }
+  if (!result.finished) {}
 }
 

[NoCoverage] StringLiteral
next/src/server/image-optimizer.ts:1278:19
     isDev
   )
   if (!result.finished) {
-    res.setHeader('Content-Length', Buffer.byteLength(buffer))
+    res.setHeader("", Buffer.byteLength(buffer))
     // A response body must not be sent for HEAD requests
     if (req.method === 'HEAD') {

[NoCoverage] ConditionalExpression
next/src/server/image-optimizer.ts:1280:9
   if (!result.finished) {
     res.setHeader('Content-Length', Buffer.byteLength(buffer))
     // A response body must not be sent for HEAD requests
-    if (req.method === 'HEAD') {
+    if (false) {
       res.end()
     } else {

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1280:32
   if (!result.finished) {
     res.setHeader('Content-Length', Buffer.byteLength(buffer))
     // A response body must not be sent for HEAD requests
-    if (req.method === 'HEAD') {
-      res.end()
-    } else {
+    if (req.method === 'HEAD') {} else {
       res.end(buffer)
     }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1282:12
     // A response body must not be sent for HEAD requests
     if (req.method === 'HEAD') {
       res.end()
-    } else {
-      res.end(buffer)
-    }
+    } else {}
   }
 }

[NoCoverage] BlockStatement
next/src/server/image-optimizer.ts:1291:4
 export async function getImageSize(buffer: Buffer): Promise<{
   width?: number
   height?: number
-}> {
-  const { width, height } = imageSizeOf(buffer)
-  return { width, height }
-}
+}> {}
 
